<template>
  <div class="page rule">
    <Header />
    <NavTop/>
    <NavRight class="z-1001"/>
    <Row :gutter="0" class="backgrond-mian">
      <Col 
        :xs="{span: 4, offset: 1}" 
        :sm="{span: 4, offset: 2}" 
        :md="{span: 4, offset: 2}" 
        :lg="{span: 3, offset: 2}"
        :xl="{span: 3, offset: 4}" class="  z-1002">
        <div class="rule-head">首页&nbsp;&gt;
          <span v-if="code === 'BJPK10'">北京PK10</span>
          <span v-if="code === 'CQSSC'">重庆时时彩</span>
          <span v-if="code === 'XJSSC'">新疆时时彩</span>
          <span v-if="code === 'PL3'">体彩排列3</span>
          <span v-if="code === 'GDKLSF'">广东快乐十分</span>
          <span v-if="code === 'GD11X5'">广东11选5</span>
          <span v-if="code === 'JSK3'">江苏快3</span>
          <span v-if="code === 'SD11X5'">十一运夺金</span>
          <span v-if="code === 'CQXYNC'">重庆辛运农场</span>
          <span v-if="code === 'K3'">快3</span>
          <span v-if="code === '11X5'">11选5</span>
          <span v-if="code === 'BJKL8'">北京快乐8</span>
          <span v-if="code === 'PCDD'">PC蛋蛋</span>
          <span v-if="code === 'FC3D'">福彩3D</span>
          <span v-if="code === 'TWBG'">台湾宾果</span>
        </div>
        <aside class="rule-content mr-2">
          <div class="lottery-menu">
            <ul class="font-weight-bold font-size-1p5">
              <li class="font-size-2">玩法规则</li>
              <li :class=" code === 'BJPK10' ? 'background-li':'' " @click="changeLottery('BJPK10')">北京PK10</li>
              <li :class=" code === 'CQSSC' ? 'background-li':'' " @click="changeLottery('CQSSC')">重庆时时彩</li>
              <li :class=" code === 'XJSSC' ? 'background-li':'' " @click="changeLottery('XJSSC')">新疆时时彩</li>
              <li :class=" code === 'PL3' ? 'background-li':'' " @click="changeLottery('PL3')">体彩排列3</li>
              <li :class=" code === 'GDKLSF' ? 'background-li':'' " @click="changeLottery('GDKLSF')">广东快乐十分</li>
              <li :class=" code === 'GD11X5' ? 'background-li':'' " @click="changeLottery('GD11X5')">广东11选5</li>
              <li :class=" code === 'JSK3' ? 'background-li':'' " @click="changeLottery('JSK3')">江苏快3</li>
              <li :class=" code === 'SD11X5' ? 'background-li':'' " @click="changeLottery('SD11X5')">十一运夺金</li>
              <li :class=" code === 'CQXYNC' ? 'background-li':'' " @click="changeLottery('CQXYNC')">重庆辛运农场</li>
              <li :class=" code === 'K3' ? 'background-li':'' " @click="changeLottery('K3')">快3</li>
              <li :class=" code === '11X5' ? 'background-li':'' " @click="changeLottery('11X5')">11选5</li>
              <li :class=" code === 'BJKL8' ? 'background-li':'' " @click="changeLottery('BJKL8')">北京快乐8</li>
              <li :class=" code === 'PCDD' ? 'background-li':'' " @click="changeLottery('PCDD')">PC蛋蛋</li>
              <li :class=" code === 'FC3D' ? 'background-li':'' " @click="changeLottery('FC3D')">福彩3D</li>
              <li :class=" code === 'TWBG' ? 'background-li':'' " @click="changeLottery('TWBG')">台湾宾果</li>
            </ul>
          </div>
        </aside>
      </Col>
      <Col 
         :xs="{span: 17}" :sm="{span: 16}" :md="{span: 16}" :lg="{span: 17}" :xl="{span: 13}" class="z-1000">
        <main class="rule-content ">
          <div class="rule-details mb-2 background-white">
            <div class="pk10" v-if="code === 'BJPK10'">
              <p class="text-center font-size-2p5 font-weight-bold">“PK10”游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条　根据《彩票管理条例》、《彩票管理条例实施细则》、《彩票发行销售管理办法》（财综[2012]102号）等有关规定，制定本规则。
              <p>第二条　中国福利彩票PK10游戏(以下简称PK10）由中国福利彩票发行管理中心发行和组织销售，由北京市福利彩票销售机构（以下称北京福彩机构）在所</p>  
              <p>辖区域内销售。</p>
              <p>第三条　PK10采用计算机网络系统发行，在北京福彩机构设置的销售网点销售，定期开奖。</p>
              <p>第四条　PK10实行自愿购买，凡购买者均被视为同意并遵守本规则。</p>
              <p>第五条　不得向未成年人销售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条　PK10采用排列式玩法。从左至右共有十个投注位置，排列顺序分别为一至十号位置，每个位置可从1-10的自然数中选择一个号码。投注者先选择。</p>
              <p>投注位置个数，投注位置个数最少一个、最多十个；然后按照从左至右的顺序，必须从一号位置开始，在每个位置上从1-10的自然数中选择一个号码进行投</p>
              <p>注；若投注位置个数超过两个的，后选位置的投注号码不能与前面所有已选位置的投注号码相同。投注者所选号码按位置顺序排序组成一组号码，该组号码</p>
              <p>即为一注PK10投注号码。每注金额人民币2元。购买者可对其选定的投注号码进行多倍投注，投注倍数为2、3、4、5、10。单张彩票的投注金额不得超过</p>
              <p>20000元。</p>
              <p>第七条　购买者可在北京福彩机构设置的销售网点投注。投注号码经投注机打印出兑奖凭证，交购买者保存，此兑奖凭证即为PK10彩票。</p>
              <p>第八条　PK10设置“普通”、“精确”、“精确组选”、“位置”、“拖拉机”、“猜奇偶”、“猜大小”以及“和数”投注方式，具体规定如下：</p>
              <p>（一）普通投注：从一号位置开始，选择最少一个、最多十个位置，每个位置上从1-10的自然数中选择一个号码，投注位置个数超过两个的，后选位置的投</p>
              <p>注号码不能与前面所有已选位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（二）精确投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有已选</p>
              <p>位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（三）精确组选投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有</p>
              <p>已选位置的投注号码相同，将选定位置上的号码的所有排列方式作为一注投注号码进行投注。</p>
              <p>（四）位置投注：从一至三号位置中，选择一个或二个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面已选位置的投</p>
              <p>注号码相同，将选定的一个或二个号码作为一注投注号码进行投注。</p>
              <p>（五）拖拉机投注：以一至三号位置上的开奖号码是否是一个连续的三位数字（升序或降序）作为投注结果进行投注。</p>
              <p>（六）猜奇偶投注：以一至三号位置上的开奖号码是否全部是奇数或偶数作为投注结果进行投注。“猜奇偶”投注又分为“全偶”和“全奇”两种投注。</p>
              <p>（七）猜大小投注：以一至三号位置上的开奖号码的三个数字之和的数值大小作为投注结果进行投注。“猜大小”投注又分为“猜大”和“猜小”两种投</p>
              <p>注。</p>
              <p>（八）和数投注：以一至三号位置上的开奖号码的三个数字之和的数值作为投注结果进行投注。</p>
              <p>第九条 购买者可选择机选号码投注、自选号码投注。机选号码投注是指由投注机随机产生投注号码进行投注，自选号码投注是指将购买者选定的号码输入投</p>
              <p>注机进行投注。</p>
              <p>第十条 购买者可选择多期投注。多期投注是指购买从当期起连续不超过12期的彩票。</p>
              <p>第十一条 PK10每期销售时间为20分钟。销售期号按每期开奖顺序编排。</p>
              <p>第十二条 PK10每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。若因销售终端故障、通讯线路故障和销售网点信用额度受限</p>
              <p>等原因造成投注不成功，应退还购买者投注金额。</p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十三条 PK10按当期销售额的50%、15%和35%分别计提彩票奖金、彩票发行费和彩票公益金。彩票奖金分为当期奖金和调节基金，其中，49%为当期奖</p>
              <p>金，1%为调节基金。</p>
              <p>第十四条 PK10按照不同投注方式分别设奖。具体设奖如下：</p>
              <p>（一）普通投注</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>匹配个数</td>
                    <td>选10</td>
                    <td>选9</td>
                    <td>选8</td>
                    <td>选7</td>
                    <td>选6</td>
                    <td>选5</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                    <td>选1</td>
                  </tr>
                  <tr>
                    <td>10</td>
                    <td>888888</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>9</td>
                    <td>-</td>
                    <td>80000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>8</td>
                    <td>-</td>
                    <td>10000</td>
                    <td>40000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>7</td>
                    <td>-</td>
                    <td>5000</td>
                    <td>2000</td>
                    <td>20000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>6</td>
                    <td>-</td>
                    <td>250</td>
                    <td>500</td>
                    <td>4500</td>
                    <td>10000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>5</td>
                    <td>-</td>
                    <td>50</td>
                    <td>100</td>
                    <td>400</td>
                    <td>2000</td>
                    <td>500</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>4</td>
                    <td>-</td>
                    <td>10</td>
                    <td>20</td>
                    <td>25</td>
                    <td>100</td>
                    <td>30</td>
                    <td>350</td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>3</td>
                    <td>-</td>
                    <td>5</td>
                    <td>10</td>
                    <td>10</td>
                    <td>10</td>
                    <td>8</td>
                    <td>20</td>
                    <td>160</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>1</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>10</td>
                  </tr>
                  <tr>
                    <td>0</td>
                    <td>2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                  </tr>
                </tbody>
              </table>
              <p>（二）精确投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">匹配个数</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">4</td>
                    <td>5000</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">3</td>
                    <td>-</td>
                    <td>700</td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>90</td>
                  </tr>
                </tbody>
              </table>
              <p>（三）精确组选投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">投注方式</td>
                    <td>组选4</td>
                    <td>组选3</td>
                    <td>组选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">中奖金额(元/注)</td>
                    <td>205</td>
                    <td>118</td>
                    <td>44</td>
                  </tr>
                </tbody>
              </table>
              <p>（四）位置、拖拉机、猜奇偶、猜大小、和数投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="3">投注方式</td>
                    <td colspan="2">中奖金额</td>
                  </tr>
                  <tr>
                    <td  colspan="2" rowspan="2"><span class="position-relative">位置投注</span></td>
                    <td>位置1</td>
                    <td colspan="2">3</td>
                  </tr>
                  <tr>
                    <td>位置2</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td colspan="3">拖拉机投注</td>
                    <td colspan="2">44</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜奇偶投注</span></td>
                    <td>全偶</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td>全寄</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜大小投注</span></td>
                    <td>猜大</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td>猜小</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="22"><span class="sum-bet position-relative">和数投注</span></td>
                    <td>和数6</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数7</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数8</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数9</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数10</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数11</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数12</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数13</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数14</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数15</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数16</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数17</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数18</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数19</td>
                    <td>13</td>
                  </tr>
                  <tr>
                    <td>和数20</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数21</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数22</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数23</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数24</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数25</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数26</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数27</td>
                    <td colspan="2">118</td>
                  </tr>
                </tbody>
              </table>
              <p>第十五条 PK10设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别奖。</p>
              <p>动用调节基金设立特别奖，应报同级财政部门审核批准</p>
              <p>第十六条 PK10设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于当期计提奖金时，余额进入奖池；当期实际中出奖</p>
              <p>金超过当期计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票兑奖周转金垫支。在出现彩票兑奖周转</p>
              <p>金垫支的情况下，当调节基金有资金滚入时优先偿还垫支的彩票兑奖周转金。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十七条 PK10采用专用电子开奖设备开奖。每期开奖时按照从左至右的顺序进行，第一个开出的号码对应一号位置，第二个开出的号码对应二号位置，依</p>
              <p>次类推，直到开出对应十号位置的号码为止，这十个位置对应的号码排列组成当期开奖号码。每期开奖时间为20分钟。</p>
              <p>第十八条 每期开奖后，北京福彩机构应向社会公布开奖号码、当期销售总额、各奖级中奖情况及奖池资金余额等信息，并将开奖结果通知销售网点。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第十九条 根据购买者选择的PK10的投注号码和投注方式与当期开奖号码按数位顺序的相符情况，确定相应的中奖资格。具体规定如下：</p>
              <p>（一）普通投注</p>
              <p>投注一个位置：投注号码与对应位置的开奖号码完全相同，即选一中一，中奖10元。</p>
              <p>投注两个位置：投注号码与对应位置的两个开奖号码完全相同，即选二中二，中奖55元；其中任意一个相同，即选二中一，中奖2元。</p>
              <p>投注三个位置：投注号码与对应位置的三个开奖号码完全相同，即选三中三，中奖160元；其中任意两个相同，即选三中二，中奖10元；其中任意一个相</p>
              <p>同，即选三中一，中奖2元。</p>
              <p>投注四个位置：投注号码与对应位置的四个开奖号码完全相同，即选四中四，中奖350元；其中任意三个相同，即选四中三，中奖20元；其中任意两个相</p>
              <p>同，即选四中二，中奖5元；其中任意一个相同，即选四中一，中奖2元。</p>
              <p>投注五个位置：投注号码与对应位置的五个开奖号码完全相同，即选五中五，中奖500元；其中任意四个相同，即选五中四，中奖30元；其中任意三个相</p>
              <p>同，即选五中三，中奖8元；其中任意两个相同，即选五中二，中奖3元；其中任意一个相同，即选五中一，中奖2元。</p>
              <p>投注六个位置：投注号码与对应位置的六个开奖号码完全相同，即选六中六，中奖10000元；其中任意五个相同，即选六中五，中奖2000元；其中任意四个</p>
              <p>相同，即选六中四，中奖100元；其中任意三个相同，即选六中三，中奖10元；其中任意两个相同，即选六中二，中奖2元。</p>
              <p>投注七个位置：投注号码与对应位置的七个开奖号码完全相同，即选七中七，中奖20000元；其中任意六个相同，即选七中六，中奖4500元；其中任意五个</p>
              <p>相同，即选七中五，中奖400元；其中任意四个相同，即选七中四，中奖25元；其中任意三个相同，即选七中三，中奖10元；其中任意两个相同，即选七中</p>
              <p>二，中奖2元。</p>
              <p>投注八个位置：投注号码与对应位置的八个开奖号码完全相同，即选八中八，中奖40000元；其中任意七个相同，即选八中七，中奖2000元；其中任意六个</p>
              <p>相同，即选八中六，中奖500元；其中任意五个相同，即选八中五，中奖100元；其中任意四个相同，即选八中四，中奖20元；其中任意三个相同，即选八</p>
              <p>中三，中奖10元；其中任意两个相同，即选八中二，中奖2元。</p>
              <p>投注九个位置：投注号码与对应位置的九个开奖号码完全相同，即选九中九，中奖80000元；其中任意八个相同，即选九中八，中奖10000元；其中任意七</p>
              <p>个相同，即选九中七，中奖5000元；其中任意六个相同，即选九中六，中奖250元；其中任意五个相同，即选九中五，中奖50元；其中任意四个相同，即选</p>
              <p>九中四，中奖10元；其中任意三个相同，即选九中三，中奖5元；其中任意两个相同，即选九中二，中奖2元。</p>
              <p>投注十个位置：投注号码与对应位置的十个开奖号码完全相同，即选十中十，中奖888888元；投注号码与对应位置的十个开奖号码全部不同，中奖2元。</p>
              <p>（二）精确投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码完全相同，即选二中二，中奖90元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码完全相同，即选三中三，中奖700元</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码完全相同，即选四中四，中奖5000元。</p>
              <p>（三）精确组选投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码不按先后顺序一一对应，即中精确组选2奖，中奖44元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码不按先后顺序一一对应，即中精确组选3奖，中奖118元。</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码不按先后顺序一一对应，即中精确组选4奖，中奖205元。</p>
              <p>（四）位置投注</p>
              <p>位置1：投注号码与一至三号位置中任意一个位置上的开奖号码相同，即中奖3元；</p>
              <p>位置2：投注号码与一至三号位置中任意两个位置上的开奖号码不按先后顺序一一对应，即中奖15元。</p>
              <p>（五）拖拉机投注</p>
              <p>一至三号位置上的三个开奖号码按照升序或降序排列成连续的三位数字（“9-10-1”和“1-10-9”、“10-1-2”和“2-1-10”除外），即中奖44元。</p>
              <p>（六）猜奇偶投注</p>
              <p>全偶：一至三号位置上的三个开奖号码全部为偶数，即中奖12元。</p>
              <p>全奇：一至三号位置上的三个开奖号码全部为奇数，即中奖12元。</p>
              <p>（七）猜大小投注</p>
              <p>猜大：一至三号位置上开奖号码的三个数字之和介于21（含）和27（含）之间，即中奖5元；</p>
              <p>猜小：一至三号位置上开奖号码的三个数字之和介于6（含）和12（含）之间，即中奖5元。</p>
              <p>（八）和数投注</p>
              <p>投注号码与一至三号位置上开奖号码的三个数字之和相同，即中奖。</p>
              <p>第二十条 当期每注投注号码只有一次中奖机会，按其投注方式中得匹配号码最多的奖等，不能兼中兼得，特别设奖除外。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十一条 PK10兑奖期当期有效。中奖者应当自开奖之日起60个自然日内，持中奖彩票到指定的地点兑奖。逾期未兑奖视为弃奖，弃奖奖金纳入彩票公益</p>
              <p>金。</p>
              <p>第二十二条 中奖彩票是兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</p>
              <p>第二十三条 兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p class="font-size-1p5 font-weight-bold">附则</p>
              <p>第二十四条 本规则自批准之日起执行。</p>
            </div>
            <div class="cqssc" v-if="code === 'CQSSC'">
              <p class="text-center font-size-2p5 font-weight-bold">重庆欢乐生肖玩法规则</p>
              <p>1.“生肖”动物十选一，选中即中奖，每20分钟开奖一次。</p>
              <p>2.“欢乐生肖”游戏共设5种颜色开奖区域，10种生肖</p>
              <p class="ml-2">5种颜色分别为：紫区、黄区、蓝区、红区、绿区</p>
              <p class="ml-2">10种生肖分别为：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪</p>
              <p>「欢乐生肖」与「时时彩」对比：</p>
              <p class="ml-2">「欢乐生肖」生肖：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪分别对应</p>
              <p class="ml-2">「时时彩 」数字： 0、 1、 2、 3、 4、 5、 6、 7、 8、 9</p>
              <p class="ml-2">「欢乐生肖」颜色：  紫、黄、蓝、红、绿分别对应</p>
              <p class="ml-2">「时时彩」开奖区域：万、千、百、十、个位开奖区域</p>
              <p>4.①欢乐生肖有欢乐一、欢乐二、欢乐三、欢乐五 四种玩法</p>
              <p class="ml-2">欢乐一：投注绿色区域，单注投注金额2元，单注奖金10元。</p>
              <p class="ml-2">欢乐二：投注红色和绿色区域，单注投注金额2元，单注奖金100元。</p>
              <p class="ml-2">欢乐三：投注蓝色、红色和绿色区域，单注投注金额2元，单注奖金1000元。</p>
              <p class="ml-2">欢乐五：投注紫色、黄色、蓝色、红色和绿色区域，单注投注金额2元，单注奖金     100000元</p>
              <p>②欢乐生肖有欢乐组合二、欢乐组合三、欢乐组合五 三种组合玩法</p>
              <p class="ml-2">欢乐二组合：投注红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中红色、绿色区域，获得奖</p>
              <p>金100元。</p>
              <p class="ml-2">欢乐三组合：投注蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中蓝色、红色、绿色</p>
              <p>区域，获得奖金1000元。</p>
              <p class="ml-2">欢乐五组合：投注紫色、黄色、蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中紫</p>
              <p>色、黄色、蓝色、红色、绿色区域，获得奖金100000元。</p>
              <p class="font-size-2p1font-weight-bold">投注</p>
              <p>1、投注者可在全市所有经市福利彩票发行中心批准、并展示《中国福利彩票“时时彩”销售许可证》的投注站投注。</p>
              <p>2、投注者可选择电话投注或投注卡、银行卡投注，并遵守相应规范。</p>
              <p>3、按不同游戏，投注方法可分自选和机选生肖投注；单倍和多倍投注。</p>
              <p>4、通过投注单投注时，按照投注单上的要求及所示方法正确填涂。
              <p>5、投注生肖经投注机确认，打印在“时时彩”电脑福利彩票上，作为对奖凭证，交投注者</p>
              <p>6、每注投注金额为人民币2元，每张彩票可打印1—5注投注生肖，投注者可选择多倍投注。</p>
              <p>7、投注前彩民应对投注进行确认，彩票售出后不得退换。</p>
              <p>8、如因投注机或通讯故障，投注站销售金额受限等原因造成投注不成功，投注站应立即退还相应收取的投注金额，彩民可选择到其它</p>
              <p>投注站投注或电话投注的方式。如使用卡投注，系统将在一个工作日内返回相应投注款。</p>
              <p>9、每期的每个投注生肖的投注注数，根据市场销售情况限量发行。如投注生肖受限，投注不能成功，属时时彩游戏规则规定的正常运</p>
              <p>行情况，投注者只能在该生肖恢复销售后继续投注。</p>
              <p>11、未成年人不得参与投注。</p>
              <p class="font-size-2p1 font-weight-bold">设奖</p>
              <p>1、每期销售总额的 50 %计提当期返奖奖金。设置奖池，奖池由当期计提奖金与实际中出奖金的差额以及弃奖奖金组成。当期实际中</p>
              <p>出奖金未达当期计提奖金时，余额进入奖池；当期实际中出奖金超过当期计提奖金时，差额由奖池补充。当奖池总额不足时，由发行</p>
              <p>经费垫支。</p>
              <p>2、“欢乐生肖”游戏共设四个奖等，固定设奖，单注奖额分别为欢乐五奖100，000元、欢乐三奖1000元、欢乐二奖100元、欢乐一奖</p>
              <p>10元。</p>
              <p>3、“欢乐生肖”游戏组合，将欢乐一、欢乐二、欢乐三、欢乐五组合投注在一张彩票上，按实际中得奖等，合并计算奖金。奖金设置</p>
              <p>分别适用欢乐一、欢乐二、欢乐三、欢乐五中奖条件。</p>
              <p class="font-size-2p1 font-weight-bold">开奖</p>
              <p>1、每20分钟开奖一次开奖通过电子开奖系统进行。开奖结果由视频信号或公众媒体播出。</p>
              <p>2、销售截止，销售数据收集完毕，通过电子签名进行不可更改的电子加密后，方可正式开奖。</p>
              <p>3、中奖生肖由电子开奖系统产生。开奖时按绿区、红区、蓝区、黄区、紫区先后产生5个生肖组成中奖生肖。例如，如依次产生的5个</p>
              <p>生肖分别为：蛇、鼠、虎、龙、马。 那么“马龙虎鼠蛇”的数字排列序列称为中奖生肖。</p>
              <p>4、重庆市福利彩票发行中心根据中奖生肖进行检索、派彩，产生当期各奖等中奖注数及总奖额。</p>
              <p>5、各期开奖后，立即通过网络向投注终端发布中奖生肖和开奖结果。</p>
              <p>6、最后一期开奖是23：50，20分钟后（隔日第一期00：10）开放下注，故23：50-00：10中间会中断20分钟</p>
              <p class="font-size-2p1 font-weight-bold">中奖</p>
              <p>按投注生肖与中奖生肖按位相符情况确定中奖奖级，中奖生肖从个位对起：</p>
              <p>按“欢乐”级进行对奖，即欢乐五限对特等奖，欢乐三限对一等奖，欢乐二限对二等奖，欢乐一限对三等奖，互不混对。凡符合下列</p>
              <p>情况的，即获得相应中奖资格：</p>
              <p>欢乐五：单注投注生肖的5个生肖与当期中奖生肖的5位生肖按位全部相符，即中奖；</p>
              <p class="ml-2">欢乐三：单注投注生肖与当期中奖生肖的连续后3位生肖按位相符（蓝区+红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐二：单注投注生肖与当期中奖生肖的连续后2位生肖按位相符（红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐一：单注投注生肖与当期中奖生肖的绿区生肖按位相符，即中奖；</p>
            </div>
            <div class="xjssc" v-if="code === 'XJSSC'">
              <p class="text-center font-size-2p5 font-weight-bold">新疆时时彩游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条 根据《彩票管理条例》等有关规定，制定本规则。 </p>
              <p>第二条 中国福利彩票新疆维吾尔自治区时时彩（以下简称“时时彩”）由中国福利彩票发行管理中心组织发行，新疆维吾尔自治区福利彩票销售机构（以下</p>
              <p>称“新疆福彩机构”）在所辖区域内组织销售。 </p>
              <p>第三条 时时彩采用计算机系统发行销售，定期开奖。 </p>
              <p>第四条 时时彩实行自愿购买，凡购买该彩票均被视为同意并遵守本规则。 </p>
              <p>第五条 不得向未成年人出售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条 时时彩是从00000到99999中任意选择一个1位至5位自然数组成一注彩票进行单式投注。五个位置从左至右分别</p>
              <p>为“万位”、“千位”、“百位”、“十位”、“个位”，共设置直选、组选、任选、五星通选、大小单双、趣味二星、区</p>
              <p>间二星等投注方式。每注金额人民币2元。 </p>
              <p>第七条 直选投注包括一星、二星、三星、四星、五星 </p>
              <p>直选投注： </p>
              <p>（一）直选一星：是指投注者从0-9的数字号码中任意选择一个，对个位、十位、百位、千位、万位其中任何一位进行投</p>
              <p>注。 </p>
              <p>（二）直选二星：是指分别从“十位”、“个位”任选一个号码组合为一个两位数排列的直选投注。 </p>
              <p>（三）直选三星：是指分别从“百位”、“十位”、“个位”任选一个号码组合为一个三位数排列的直选投注。 </p>
              <p>（四）直选四星：是指分别从“千位”、“百位”、“十位”、“个位”任选一个号码组合为一个四位数排列的直选投注。</p>
              <p>（五）直选五星：是指分别从“万位”、“ 千位”、“百位”、“十位”、“个位”任选一个号码组合为一个五位数排列的</p>
              <p>直选投注。 </p>
              <p>第八条 直选投注的投注方式分为单选投注和复选投注。单选投注是将一组投注号码以唯一的排列方式进行单注投注。复选投</p>
              <p>注是指将各星级组合在一起作为一组投注号码的多注投注。复选投注范围从二星奖到五星奖，当所选号码在某一星级中奖</p>
              <p>时，也同时中得该星级以下的相应奖级。 </p>
              <p>第九条 组选投注包括二星、三星组选： </p>
              <p>（一）二星组选：是指从0-9十个数字中任选两个不同的数字对“十位”和“个位”进行组选投注。 </p>
              <p>（二）三星组选：是指投注者可在0-9十个自然数中任意选择三个数字对“百位”、“十位”、“个位”进行组选投注，包</p>
              <p>括“三星组选六”和“三星组选三”。 </p>
              <p>1、三星组选六：如果一注号码的三个数字各不相同，则有六种排列方式，称为“三星组选六”。</p>
              <p>2、三星组选三：如果一注号码的三个数字中有两个数字相同，则有三种排列方式，称为“三星组选三”。 </p>
              <p>第十条 任选投注包括二星、三星任选：</p>
              <p>（一）二星任选：是指投注者在“万位”、“千位”、“百位”、“十位”、“个位”的任意两位中，每位从0-9十个数字号</p>
              <p>码中任选一个号码组合为一个两位数字排列的直选投注。 </p>
              <p>（二）三星任选：是指投注者在“万位”、“千位”、“百位”、“十位”、“个位”的任意三位中，每位从0-9十个数字号</p>
              <p>码中任选一个号码组合为一个三位数字排列的直选投注。 </p>
              <p>第十一条 五星通选投注是指从00000-99999中选择一个五位数排列进行通选投注。 </p>
              <p>第十二条 大小单双投注是指投注者对“十位”和“个位”位置的数字进行“大小、单双”的指定投注，0-4为小号，5-9为大</p>
              <p>0、2、4、6、8为双号。 </p>
              <p>第十三条 趣味二星投注是指个位和十位分别从0-9的数字号码中选择一个数字，百位从“大小号”中任选一种进行的排列投注。其中，0-4为“小号”；5-9</p>
              <p>为“大号”。 </p>
              <p>第十四条 区间二星投注是指个位和十位分别从0-9的数字号码中任选一个数字，百位从5个区间中任选一区间进行唯一排列方式的投注（下列区间简</p>
              <p>称“区”）。其中，百位上数字“0”和“1”为一区，“2” 和“3”为二区，“4” 和“5”为三区，“6” 和“7”为四区，“8”和“9”为五区。 </p>
              <p>第十五条 时时彩每期销售时间为20分钟。销售期号按每期开奖顺序编排。 </p>
              <p>第十六条 购买者应在新疆福彩机构设置的投注站进行投注。投注号码可由投注机随机产生，也可通过投注单将购买者选定的号码输入投注机确定。投注号码</p>
              <p>经系统确认后打印出的对奖凭证即为时时彩彩票，交购买者保存。 </p>
              <p>第十七条 时时彩每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。 </p>
              <p>第十八条 若因销售终端故障、通讯线路故障和投注站授权额度受限等原因造成投注不成功，应退还投注者投注金额。 </p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十九条 时时彩按每期销售额的59%、13%、28%分别计提彩票奖金、彩票发行费和彩票公益金。彩票奖金分为当期奖金和调节基金，58%为当期奖金，</p>
              <p>1%为调节基金。 </p>
              <p>第二十条 时时彩按不同单式投注方式设奖，均为固定奖。奖金规定如下： </p>
              <p>（一）直选投注 </p>
              <p>1、五星直选：单注奖金固定为116000元； </p>
              <p>2、四星直选： </p>
              <p>（1）四星直选一等奖：单注奖金固定为9999元； </p>
              <p>（2）四星直选二等奖：单注奖金固定为75元； </p>
              <p>3、三星直选：单注奖金固定为1160元；</p>
              <p>4、二星直选： </p>
              <p>（1）二星直选一等奖：单注奖金固定为100元； </p>
              <p>（2）二星直选二等奖：单注奖金固定为16元； </p>
              <p>5、一星直选：单注奖金固定为11元。 </p>
              <p>（二）组选投注 </p>
              <p>1、二星组选：单注奖金固定为58元。 </p>
              <p>2、三星组选： </p>
              <p>（1）三星组选六：单注奖金固定为192元； </p>
              <p>（2）三星组选三：单注奖金固定为386元。 </p>
              <p>（三）任选投注 </p>
              <p>1、二星任选： </p>
              <p>（1）二星任选一等奖：单注奖金固定为80元； </p>
              <p>（2） 二星任选二等奖：单注奖金固定为9元。 </p>
              <p>2、三星任选： </p>
              <p>（1）三星任选一等奖：单注奖金固定为600元； </p>
              <p>（2）三星任选二等奖：单注奖金固定为20元。 </p>
              <p>（四）五星通选投注 </p>
              <p>1、五星通选一等奖：单注奖金固定为32000元； </p>
              <p>2、五星通选二等奖：单注奖金固定为220元； </p>
              <p>3、五星通选三等奖：单注奖金固定为20元。 </p>
              <p>（五）大小单双投注 </p>
              <p>大小单双：单注奖金固定为4.5元； </p>
              <p>（六）趣味二星投注 </p>
              <p>1、趣味二星一等奖：单注奖金固定为180元； </p>
              <p>2、趣味二星二等奖：单注奖金固定为20元； </p>
              <p>3、趣味二星三等奖：单注奖金固定为12元。 </p>
              <p>（七）区间二星投注 </p>
              <p>（1）区间二星一等奖：单注奖金固定为500元； </p>
              <p>（2）区间二星二等奖：单注奖金固定为20元。 </p>
              <p>第二十一条 时时彩设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别</p>
              <p>奖。动用调节基金设立特别奖，应报同级财政部门审核批准。 </p>
              <p>第二十二条 时时彩设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于计提奖金时，余额进入奖池；当期实际中出奖金</p>
              <p>超过计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票机构业务费垫支。在出现业务费垫支的情况</p>
              <p>下，当调节基金有资金滚入时优先偿还垫支的业务费。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第二十三条 时时彩采用专用电子开奖设备开奖，每期开出一组5位自然数作为当期开奖号码。开奖号码的顺序不能颠倒，每期开奖时间为20分钟。 </p>
              <p>第二十四条 每期开奖统计数据以新疆福彩机构数据中心收到的销售有效数据为准。每天将当日所有数据刻入不可改写的光盘，并将当日所有数据提交公证处</p>
              <p>备查。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第二十六条 购买者所购彩票的投注号码与当期开奖号码对照，符合以下情况即为中奖。</p>
              <p>（一）直选投注 </p>
              <p>1、五星直选：投注号码由00000—99999组成，投注号码与当期开奖号码按位全部相符（万位+千位+百位+十位+个位），即中奖； </p>
              <p>2、四星直选： </p>
              <p>（1）四星直选一等奖：投注号码由0000—9999组成，投注号码与当期开奖号码的连续后四位号码按位相符（千位+百位+十位+个位），即中奖； </p>
              <p>（2）四星直选二等奖：投注号码由0000—9999组成，投注号码的首或尾三位连续号码与当期开奖号码的首或尾连续三位号码按位相符，即中奖； </p>
              <p>3、三星直选：投注号码由000—999组成，投注号码与当期开奖号码的连续后三位号码按位相符（百位+十位+个位），即中奖； </p>
              <p>4、二星直选： </p>
              <p>（1）二星直选一等奖：投注号码由00—99组成，投注号码与当期开奖号码的连续后两位号码按位相符（十位+个位），即中奖</p>
              <p>（2）二星直选二等奖：投注号码由00—99组成，投注号码与当期开奖号码的连续后两位号码不按位相符（十位+个位），即中奖。 </p>
              <p>5、一星直选：投注号码由0—9和个位、十位、百位、千位、万位其中的任何一位组成，投注号码与当期开奖号码对应位置的号码相符，即中奖；</p>
              <p>（二）组选投注 </p>
              <p>1、二星组选：投注号码与当期开奖号码的连续后两位号码相同（顺序不限），即中奖。 </p>
              <p>2、三星组选：投注号码与当期开奖号码的连续后三位号码相同（顺序不限），即中奖。 </p>
              <p>（三）任选投注 </p>
              <p>1、二星任选： </p>
              <p>（1）二星任选一等奖：投注号码与当期开奖号码所对应位置的两位号码按位相符，即中奖。 </p>
              <p>（2）二星任选二等奖：投注号码与当期开奖号码对应位置的两位号码的首位加1或减1相符且末位按位相符，或末位加1或减1相符且首位按位相符，即中奖</p>
              <p>（0减1为9）。 </p>
              <p>2、三星任选： </p>
              <p>（1）三星任选一等奖：投注号码与当期开奖号码所对应位置的三位号码按位相符，即中奖。 </p>
              <p>（2）三星任选二等奖：投注号码中任意两位与当期开奖号码所对应位置的两位号码按位相符，即中奖。 </p>
              <p>（四）五星通选投注 </p>
              <p>1、五星通选一等奖：投注五位数号码与当期开奖号码相同且排列一致，即中奖； </p>
              <p>2、五星通选二等奖：投注五位数号码中首或尾连续三位数号码与当期开奖号码首或尾连续三位数数字相同且排列一致，即中奖； </p>
              <p>3、五星通选三等奖：投注五位数号码中首或尾连续两位数号码与当期开奖号码首或尾连续两位数数字相同且排列一致，即中奖。 </p>
              <p>（五）大小单双投注 </p>
              <p>大小单双：投注号码“十位、个位”数字的“大小、单双”与当期开奖号码“十位、个位”数字的“大小、单双”位置、性质相同，即中奖。 </p>
              <p>（六）趣味二星投注 </p>
              <p>1、趣味二星一等奖：投注号码个位、十位与开奖号码按位相符，且投注号码百位的“大小号”与开奖号码的“大小号”相符，即中奖，并同时中得趣味二</p>
              <p>星二等奖；</p>
              <p>2、趣味二星二等奖：投注号码个位、十位与开奖号码按位相符，但投注号码百位的“大小号”与开奖号码的“大小号”不相符，即中奖；</p>
              <p>3、趣味二星三等奖：投注号码个位、十位与开奖号码不按位相符，且投注号码百位的“大小号”与开奖号码的“大小号”相符，即中奖。 </p>
              <p>（七）区间二星投注 </p>
              <p>1、区间二星一等奖：投注号码个位、十位与开奖号码按位相符，且投注百位的区间与开奖号码百位区间相同，即中奖； </p>
              <p>2、区间二星二等奖：投注号码个位、十位与开奖号码按位相符，但投注百位的区间与开奖号码百位区间不相同，即中奖。</p>
              <p>第二十七条 除五星通选、四星直选、趣味二星投注和特别设奖外，当期每注投注号码只能按其选择的投注方式在相应的星级上有一次中奖机会，各种投注方</p>
              <p>式不能兼中兼得。 </p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十八条 时时彩中奖当期有效。每期自开奖之日起60个自然日为兑奖期，逾期未兑视为弃奖。弃奖奖金纳入彩票公益金。</p>
              <p>第二十九条 中奖彩票为兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。 </p>
              <p>第三十条 兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。 </p>
              <p>附则</p>
              <p>第三十一条 本规则自批准之日起执行。</p>
            </div>
            <div class="pl3" v-if="code === 'PL3'">
              <p class="text-center font-size-2p5 font-weight-bold">体彩排列3玩法规则</p>
              <p class="font-size-1p5 font-weight-bold">排列三游戏规则</p>
              <p>“排列三”原为“7星彩”附加玩法，自2004年12月8日起从原有的七星彩玩法中分离出来，单独使用摇奖机、摇奖球进行摇奖，“排列三”、“排列5”共</p>
              <p>同摇奖，一次摇出5个号码，“排列三”的中奖号码为当期摇出的全部中奖号码的前3位，“排列5”的中奖号码为当期摇出的全部中奖号码，每日进行开</p>
              <p>奖。</p>
              <p class="font-size-1p5 font-weight-bold">第一章 总则</p>
              <p>第一条 根据财政部《彩票发行与销售管理暂行规定》和国家体育总局《体育彩票发行与销售管理暂行办法》特制定本游戏规则。</p>
              <p>第二条 体彩排列3电脑体育彩票由国家体育总局体育彩票管理中心统一发行，在全国范围内采用计算机网络系统进行联合销售。</p>
              <p>第三条 体彩排列3实行自愿购买，凡购买该彩票者即被视为同意并遵守本规则。</p>
              <p class="font-size-1p5 font-weight-bold">第二章 游戏方法</p>
              <p>第四条 购买"体彩排列3"时，由购买者从000-999的数字中选取1个3位数为投注号码进行投注。</p>
              <p>第五条 购买者可在全国各省（区、市）体育彩票管理中心设置的投注站进行投注。投注号码可由投注机随机产生，也可通过投注单将购买者选定的号码输入</p>
              <p>投注机确定。投注号码经系统确认后打印出的兑奖凭证即为体彩排列3电脑体育彩票，交购买者保存。</p>
              <p>第六条 “体彩排列3”电脑体育彩票每注2元人民币。不记名，不挂失，不返还本金，不流通使用</p>
              <p class="font-size-1p5 font-weight-bold">第三章 奖级设定</p>
              <p>第七条 "体彩排列3"按"直选投注"、"组选3"、"组选6"等不同投注方式进行设奖，均设一个奖级，为固定奖</p>
              <p>。</p>
              <p>第八条 各奖级奖金分配： "直选投注"，单注固定奖金1000元。 "组选3"，单注固定奖金320元。 "组选6"，单注固定奖金160元。</p>
              <p>第九条 销售总额的50％为奖金, 分为当期奖金和调节基金。其中，49%为当期奖金，1%为调节基金。</p>
              <p class="font-size-1p5 font-weight-bold">第四章 开奖及公告</p>
              <p>第十条 "体彩排列3"天天开奖，摇奖过程在公证人员监督下进行，通过电视台播出。 "体彩排列3"“排列5”同时开奖，一次产生5个号码，其中奖号码为当</p>
              <p>期摇出的全部中奖号码的前3位。</p>
              <p>第十一条 每期开奖后，国家体育总局体育彩票管理中心需将中奖号码、当期销售总额、各奖等中奖情况以及奖池资金余额等信息，通过新闻媒体向社会公</p>
              <p>布，并将开奖结果通知各销售终端。</p>
              <p class="font-size-1p5 font-weight-bold">第五章 中奖办法</p>
              <p>第十二条 所购彩票与开奖结果对照，符合以下情况即为中奖： "直选投注"：所选号码与中奖号码相同且顺序一致，则该注彩票中奖。例如，中奖号码为</p>
              <p>543，则中奖结果为：543。</p>
              <p>“组选 3”：中奖号码中任意两位数字相同（500.com注：开奖号码中的3个数字有两个相同，即为组三），所选号码与中奖号码相同且顺序不限，则该注</p>
              <p>彩票中奖。例如，中 奖号码为 544 ，则中奖结果为： 544 、 454 、 445 之一均可。</p>
              <p>组选6"： 所选号码与中奖号码相同且顺序不限，则该注彩票中奖。例如，中奖号码为543，则中奖结果为：543、534、453、435、345、354之一均可。</p>
              <p>第十三条 当期每注彩票只有一次中奖机会，不得兼中兼得，另行设立的特别奖项除外。</p>
              <p class="font-size-1p5 font-weight-bold">第六章; 兑奖</p>
              <p>第十四条“体彩排列3”兑奖当期有效。每期自开奖次日起60天为兑奖期，逾期未兑，视为弃奖纳入调节基金。</p>
              <p>第十五条兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p>第十六条凡伪造、涂改中奖彩票，冒领奖金者，送交司法机关追究法律责任。</p>
              <p class="font-size-1p5 font-weight-bold">第七章; 附则</p>
              <p>第十七条本游戏规则解释权属国家体育总局体育彩票管理中心。</p>
              <p>第十八条本游戏规则自下发之日起执行.</p>
              <p class="text-center font-size-2 font-weight-bold">新玩法补充说明</p>
              <p class="font-size-1p5 font-weight-bold">1、直选组合复式</p>
              <p>排列3玩法直选组合复式票是从0～9中选择M（M>=3)个不重复数字，组合成P(3,M)个单式投注，票面上标明“直选组合复式票”。</p>
              <p>例如：彩民选择1、2、3、4这4个号码，就是要实现包含这4个数字的全部排列3直选号码：123、132、321、312、213、231、124、142、214、241、</p>
              <p>412、421、234、243、324、342、432、423、134、143、341、314、431、413共24注号码，能在一张彩票上表现出来。</p>
              <p class="font-size-1p5 font-weight-bold">2、直选组合胆拖复式</p>
              <p>排列3玩法从0～9中选择M（0&lt;M&lt;=2)个不重复数字作为胆码，选择N（N＋M&gt;=4）个不重复、且不包含在胆码中的数字作为拖码，组合成P(3,3)×C[(3-</p>
              <p>M),N]个直选投注，票面上标明“直选组合胆拖票”。</p>
              <p>例如，胆码为数字1，拖码为2、3、4。该直选组合胆拖票是把123、132、321、312、213、231、124、142、214、241、412、421、134、143、</p>
              <p>341、314、431、413这18注号码在一张彩票上表现出来。</p>
              <p class="font-size-1p5 font-weight-bold">3、直选跨度复式</p>
              <p>什么叫跨度：排列3开奖号码中最大数与最小数之差称为排列3跨度，排列3共有0～9十种跨度。彩民投注时，猜排列3开奖时开奖号码的最大数与最小数之</p>
              <p>差的值，即猜跨度，称为跨度投注。跨度投注分为3种：直选跨度投注、组选3跨度投注、组选6跨度投注。 </p>
              <p>排列3玩法直选跨度票是满足跨度为n（0～9）的所有可能的排列3直选票，票面标明“直选跨度票”。如，直选跨度票，当跨度为0时，包含000、111、</p>
              <p>222、333、444、555、666、777、888、999共10注直选票。</p>
              <p>下表是直选跨度票投注各跨度所包含的直选票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含直选票</td>
                    <td>10注</td>
                    <td>54注</td>
                    <td>95注</td>
                    <td>126注</td>
                    <td>144注</td>
                    <td>150注</td>
                    <td>144注</td>
                    <td>126注</td>
                    <td>96注</td>
                    <td>54注</td>
                  </tr>
                </tbody>
              </table>
              <p class="font-size-1p5 font-weight-bold">4、组选3跨度复式（排列3）</p>
              <p>组选3跨度票是满足跨度为n（0～9）的所有可能的组选3票，票面标明“组选3跨度票”。打印票面显示跨度值，不拆开显示组选3票。</p>
              <p>如，组选3跨度票，当跨度为9时，包含099、900共2注组选3票；</p>
              <p>当跨度为8时，包含088、800、199、911共4注组选3票；</p>
              <p>下表是组选3跨度票投注各跨度所包含的组选3票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含组选6票</td>
                    <td>0注</td>
                    <td>0注</td>
                    <td>8注</td>
                    <td>14注</td>
                    <td>18注</td>
                    <td>20注</td>
                    <td>20注</td>
                    <td>18注</td>
                    <td>14注</td>
                    <td>8注</td>
                  </tr>
                </tbody>
              </table>
              <p>（说明：当跨度为0时，没有符合跨度要求的组选3票投注，注数是0注，所以组选3跨度票不能选择跨度为0。）</p>
              <p class="font-size-1p5 font-weight-bold">5、组选6跨度复式（排列3）</p>
              <p>组选6跨度票是满足跨度为n（0～9）的所有可能的组选6票，票面标明“组选6跨度票”。打印票面显示跨度值，不拆开显示组选6票。</p>
              <p>如，组选6跨度票，当跨度为9时，包含019、029、039、049、059、069、079、089共8注组选6票。</p>
              <p>下表是组选6跨度票投注各跨度所包含的组选6票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含组选3票</td>
                    <td>0注</td>
                    <td>18注</td>
                    <td>16注</td>
                    <td>14注</td>
                    <td>12注</td>
                    <td>10注</td>
                    <td>8注</td>
                    <td>6注</td>
                    <td>4注</td>
                    <td>2注</td>
                  </tr>
                </tbody>
              </table>
              <p>的组选6票投注，注数是0注，所以组选6跨度票不能选择跨度为0、1。）</p>
              <p>6、组选3胆拖（排列3）</p>
              <p>从0～9中选择1个数字作为胆码，选择N（2&lt;=N&lt;=9)个不重复、且不包含在胆码中的数字作为拖码，组合成2*N个组选3投注，票面上标明“组选3胆拖</p>
              <p>票”。</p>
              <p class="font-size-1p5 font-weight-bold">7、组选6胆拖（排列3）</p>
              <p>从0～9中选择M（1&lt;＝M&lt;=2）个不重复数字作为胆码，选择N（N＋M>=4）个不重复、且不包含在胆码中的数字作为拖码，组合成C[(3-M)，N]个组选</p>
              <p>6投注，票面上标明“组选6胆拖票”。</p>
              <p class="font-size-1p5 font-weight-bold">“排列3”设奖方式：</p>
              <p>按“直选投注”、“组选3”、“组选6”分别设奖，资金为：“直选投注”单注固定奖金1000元；“组选3”单注固定奖金320元；“组选6”单注固定奖金</p>
              <p>160元。</p>
            </div>
            <div  class="gdklsf" v-if="code === 'GDKLSF'">
              <P class="text-center font-size-2p5 font-weight-bold">广东快乐十分玩法规则</P>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>财政部、中国福利彩票发行管理中心批准，一种全新的快速开奖游戏中国福利彩票“快乐十分”将于近期在我省发行销售。“快乐十分”集中了目前市场</p>
              <p>上所有快速开奖游戏的优点，返奖高，开奖快，更好玩。返奖率高达59%，每20分钟开奖一期，共10种玩法，排列、组合、数字、颜色都可选；“快乐十</p>
              <p>分”共有20个号码可供选择；每注可投1—5个号码，每期开出8个中奖号码，使中奖更容易。</p>
              <p class="font-size-1p5 font-weight-bold">广东快乐十分玩法</p>
              <table class="text-center">
                <tbody>
                  <tr>
                    <td class="w-10">玩法</td>
                    <td>投注</td>
                    <td>中奖</td>
                    <td class="w-10">中奖概率</td>
                  </tr>
                  <tr>
                    <td>选一数投</td>
                    <td class="text-left">指从01至18中任意选择1个数字号码，对开奖号码中按开奖顺序出现的第一个位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的第一个位置数字号码相符，即中奖。</td>
                    <td>1/20</td>
                  </tr>
                  <tr>
                    <td>选一红投</td>
                    <td class="text-left">指从19和20两个红色号码中任意选择1个红色号码，对开奖号码中按开奖顺序出现的第一个位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的第一个位置为红色号码，即中奖。</td>
                    <td>1/10</td>
                  </tr>
                  <tr>
                    <td>选二任选</td>
                    <td class="text-left">指从01至20中任意选择2个号码对开奖号码中任意2个位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中任意2个位置的号码相符，即中奖。</td>
                    <td>1/6.8</td>
                  </tr>
                  <tr>
                    <td>选二连组</td>
                    <td class="text-left">指从01至20中任意选择2个号码对开奖号码中按开奖顺序出现的2个连续位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的2个连续位置的号码相符（顺序不限），即中奖。</td>
                    <td>1/27</td>
                  </tr>
                  <tr>
                    <td>选二连直</td>
                    <td class="text-left">指从01至20中任意选择2个号码对开奖号码中按开奖顺序出现的2个连续位置按位相符的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的2个连续位置的号码按位相符，即中奖。</td>
                    <td>1/54</td>
                  </tr>
                  <tr>
                    <td>选三任选</td>
                    <td class="text-left">指从01至20中任意选择3个号码对开奖号码中任意3个位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中任意3个位置的号码相符，即中奖。</td>
                    <td>1/20</td>
                  </tr>
                  <tr>
                    <td>选三前组</td>
                    <td class="text-left">指从01至20中任意选择3个号码对开奖号码中按开奖顺序出现的前3个连续位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的前3个位置的号码相符（顺序不限），即中奖。</td>
                    <td>1/1140</td>
                  </tr>
                  <tr>
                    <td>选三前直</td>
                    <td class="text-left">指从01至20中任意选择3个号码对开奖号码中按开奖顺序出现的前3个连续位置按位相符的投注。</td>
                    <td class="text-left">投注号码与开奖号码中按开奖顺序出现的前3个位置的号码按位相符，即中奖。</td>
                    <td>1/6840</td>
                  </tr>
                  <tr>
                    <td>选四任选</td>
                    <td class="text-left">指从01至20中任意选择4个号码，对开奖号码中任意4个位置的投注。</td>
                    <td class="text-left">投注号码与开奖号码中任意4个位置的号码相符，即中奖。</td>
                    <td>1/69</td>
                  </tr>
                  <tr>
                    <td>选五任选</td>
                    <td class="text-left">指从01至20中任意选择5个号码，对开奖号码中任意5个位置的投注</td>
                    <td class="text-left">投注号码与开奖号码中任意5个位置的号码相符，即中奖。</td>
                    <td>1/277</td>
                  </tr>
                </tbody>
              </table>
              <p class="font-size-1p5 font-weight-bold">20分钟开奖一期</p>
              <p>据了解，即将上市的中国福利彩票“快乐十分”一个很重要的特点就是开奖快，每隔20分钟就开奖一期，是目前全国快速开奖游戏中最为“快速”的游</p>
              <p>戏之一。“快乐十分”开奖采用的是专用电子开奖设备，每期从01—20共20个号码中随机生成8个不同号码，作为当期开奖号码。每期的开奖号码都会通过</p>
              <p>与数据中心连接的视频设备显示，在每个“快乐十分”销售网点都可以收看到。</p>
              <p>10种玩法多种选择</p>
              <p>“快乐十分”是从01—20个号码中任选1—5个号码组合为一注彩票进行投注，它共有10种玩法，包含了排列、组合投注方式，特别是值得一提的是，</p>
              <p>选一投注有“选一数投”和“选一红投”，即投注时可以选数字，也可以选颜色。10种玩法按排列、组合的方式可以分为三种：一是组合玩法：选二任选、</p>
              <p>选三任选、选四任选、选五任选，这4种玩法的投注、中奖不讲顺序，只要当期开奖的8个号码中有所投注的号码，则就中奖了；二是组合兼排列的定位玩</p>
              <p>法：即定中奖号码位置但不定中奖号码出现顺序，包括选二连组、选三前组；三是排列玩法，是既定中奖号码位置又定中奖号码出现顺序，包括选一数投、</p>
              <p>选一红投和选二连直、选三前直共4种玩法。</p>
              <p class="font-size-1p5 font-weight-bold">投注号码少，开奖号码多</p>
              <p>　　“快乐十分”每注投注号码为1—5个，但是每期开出8个号码作为当期开奖号码，开奖号码远远大于所投注号码，使中奖更容易。以“快乐十分”中投</p>
              <p>注号码最多的玩法“任选五”为例，每注投注5个号码，只要这5个号码在所开奖的8个中奖号码中就中奖。特别是对于喜欢包号投注的彩民而言，如果“任</p>
              <p>选5”包8个号投注，如果所包的8个号码与8个中奖号码完全相同，则其中奖注数就达到56注，总奖金17920元。</p>
              <p class="font-size-1p5 font-weight-bold">购买方式</p>
              <p>　1)代购：代购指用户进行网上选号发起方案，并认购全部份额，然后委托本站代为购买彩票。</p>
              <p>　2)追号：追号指将一注或一组号码进行两期或两期以上的投注。追号可分为连续追号和间隔追号，连续追号指追号的期数是连续的，间隔追号指追号的</p>
              <p>期数不连续。</p>
            </div>
            <div class="gd11x5" v-if="code === 'GD11X5'">
              <p class="text-center font-size-2p5 font-weight-bold">广东11选5玩法规则</p>
              <p>11选5是从01-11共11个号码中任选1-8个号码进行投注，每期开出5个号码为中将号码，设12个奖项，相当于12个玩法，投注方式灵活，开奖频次高，全面</p>
              <p>满足不同彩民的投注需要。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选一（即选前一）： </span>从11个号码中任选1个号码，与当期第1个开奖号码相同则中奖。中奖概率1/11，单注奖金13元。</p>
              <p>特点：相当于11选1，中奖更容易，奖金更丰厚。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选二：</span>从11个号码中任选2个号码，与当期5个开奖号码中的任2个相同则中奖。中奖概率1/5.5，单注奖金6元。</p>
              <p>特点：5个开奖号码任意选对2个即中奖，中奖率最高。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选三中3：</span>从11个号码中任选3个号码，与当期5个开奖号码中的任3个相同则中奖。中奖概率1/16.5，单注奖金19元。</p>
              <p>特点：5个开奖号码任意选对3个即中奖，中奖率高。　</p>
              <p><span class="font-size-1p5 font-weight-bold">任选四中4：</span>从11个号码中任选4个号码，与当期5个开奖号码中的任4个相同则中奖。中奖率1/66，单注奖金78元。</p>
              <p>特点：5个开奖号码任意选对4个即中奖，中奖率高。　　</p>
              <p><span class="font-size-1p5 font-weight-bold">任选五中5：</span>从11个号码中任选5个号码，选中5个开奖号码即中奖，中奖率1/462，单注奖金540元。</p>
              <p>特点：2元可买5个号码。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选六中5：</span>从11个号码中任选6个号码，选中5个开奖号码即中奖，中奖率1/77，单注奖金90元。</p>
              <p>特点：2元可买6个号码。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选七中5：</span>从11个号码中任选7个号码，选中5个开奖号码即中奖，中奖率1/22，单注奖金26元。</p>
              <p>特点：2元可买7个号码。</p>
              <p><span class="font-size-1p5 font-weight-bold">任选八中5：</span>从11个号码中任选8个号码，选中5个开奖号码即中奖，中奖率1/8.25，单注奖金9元。</p>
              <p>特点：2元可买8个号码。</p>
              <p><span class="font-size-1p5 font-weight-bold">选前二组选：</span>从11个号码中任选2个号码，与当期前2个开奖号码相同即中奖，中奖概率为1/55，单注奖金65元。</p>
              <p>特点：选号简单，无须排序，无重号，相当于排列2组选。　</p>
              <p><span class="font-size-1p5 font-weight-bold">选前二直选：</span>从11个号码中任选2个号码，与当期前2个开奖号码相同且顺序一致即中奖。中奖概率为1/110，单注奖金130元。</p>
              <p>特点：选号简单，无重号，相当于排列2组选。　</p>
              <p><span class="font-size-1p5 font-weight-bold">选前三组选：</span>从11个号码中任选3个号码，选中当期前3个开奖号码即中奖，中奖概率为1/165，单注奖金195元。</p>
              <p>特点：选号简单，无须排序，无重号，相当于排列3组选六，奖金更丰厚。</p>
              <p><span class="font-size-1p5 font-weight-bold">选前三直选：</span>从11个号码中任选3个号码，选中当期前3个开奖号码且顺序一致即中奖，中奖概率1/990，单注奖金1170元。</p>
              <p>特点：选号简单，无重号，相当于排列3直选，奖金更高，中奖更容易。</p>
              <p><span class="font-size-1p5 font-weight-bold">奖级设置</span></p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>奖级</td>
                    <td>中奖概率</td>
                    <td>奖金（元）</td>
                  </tr>
                  <tr>
                    <td>任选1中1</td>
                    <td>1/11</td>
                    <td>13</td>
                  </tr>
                  <tr>
                    <td>任选2中2</td>
                    <td>1/5.5</td>
                    <td>6</td>
                  </tr>
                  <tr>
                    <td>任选3中3</td>
                    <td>1/16.5</td>
                    <td>19</td>
                  </tr>
                  <tr>
                    <td>任选4中4</td>
                    <td>1/66</td>
                    <td>78</td>
                  </tr>
                  <tr>
                    <td>任选5中5</td>
                    <td>1/462</td>
                    <td>540</td>
                  </tr>
                  <tr>
                    <td>任选6中5</td>
                    <td>1/77</td>
                    <td>90</td>
                  </tr>
                  <tr>
                    <td>选7中5</td>
                    <td>1/22</td>
                    <td>26</td>
                  </tr>
                  <tr>
                    <td>任选8中5</td>
                    <td>1/8.25</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>选前2组选</td>
                    <td>1/55</td>
                    <td>65</td>
                  </tr>
                  <tr>
                    <td>选前2直选</td>
                    <td>1/110</td>
                    <td>130</td>
                  </tr>
                  <tr>
                    <td>选前3组选</td>
                    <td>1/165</td>
                    <td>195</td>
                  </tr>
                  <tr>
                    <td>选前3直选</td>
                    <td>1/990</td>
                    <td>1170</td>
                  </tr>
                </tbody>
              </table>
            </div>
            <div class="jsk3" v-if="code === 'JSK3'">
              <p class="text-center font-size-2p5 font-weight-bold">江苏快3玩法规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条  根据《彩票管理条例》（国务院令第554号）等有关规定，制定本规则。</p>
              <p>第二条  中国福利彩票江苏省快3游戏（以下称“快3”）由中国福利彩票发行管理中心组织销售，江苏省福利彩票销售机构（以下称江苏福彩机构）在所辖</p>
              <p>区域内销售。</p>
              <p>第三条  快3采用计算机网络系统发行，在江苏福彩机构设置的销售网点销售，定期开奖。</p>
              <p>第四条  快3实行自愿购买，凡购买者均被视为同意并遵守本规则。</p>
              <p>第五条  不得向未成年人出售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条  快3投注是指以三个号码组合为一注进行单式投注，每个投注号码为1-6共六个自然数中的任意一个，一组三个号码的组合称为一注。每注金额人民</p>
              <p>币2元。购买者可对其选定的投注号码进行多倍投注，投注倍数范围为2-99倍。单张彩票的投注金额最高不得超过20000元。</p>
              <p>第七条  购买者可在相关江苏福彩机构设置的销售网点投注。投注号码经投注机打印出兑奖凭证，交购买者保存，此兑奖凭证即为快3彩票。</p>
              <p>第八条  快3根据号码组合共分为“和值”、“三同号”、“二同号”、“三不同号”、“二不同号”、“三连号通选”投注方式，具体规定如下：</p>
              <p>（一）和值投注：是指对三个号码的和值进行投注，包括“和值4”至“和值17”投注。</p>
              <p>（二）三同号投注：是指对三个相同的号码进行投注，具体分为：</p>
              <p>1、三同号通选：是指对所有相同的三个号码（111、222、…、666）进行投注；</p>
              <p>2、三同号单选：是指从所有相同的三个号码（111、222、…、666）中任意选择一组号码进行投注。</p>
              <p>（三）二同号投注：是指对两个指定的相同号码进行投注，具体分为：</p>
              <p>1、二同号复选：是指对三个号码中两个指定的相同号码和一个任意号码进行投注；</p>
              <p>2、二同号单选：是指对三个号码中两个指定的相同号码和一个指定的不同号码进行投注。</p>
              <p>（四）三不同号投注：是指对三个各不相同的号码进行投注。</p>
              <p>（六）三连号通选投注：是指对所有三个</p>
              <p>第九条  购买者可选择机选号码投注、自选号码投注。机选号码投注是指由投注机随机产生投注号码进行投注，自选号码投注是指将购买者选定的号码输入></p>
              <p>投注机进行投注。</p>
              <p>第十条  购买者可选择多期投注。多期投注是指购买从当期起连续若干期的彩票。</p>
              <p>第十一条  快3每期销售时间为20分钟。销售期号以销售日按每期开奖顺序编排。</p>
              <p>第十二条  快3每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。若因销售终端故障、通讯线路故障和投注站信用额度受限等原</p>
              <p>因造成投注不成功，应退还投注者投注金额。 </p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十三条  快3按当期销售总额的59%、13%和28%分别计提彩票奖金、彩票发行经费和彩票公益金。彩票奖金分为当期奖金和调节基金，其中，58%为当期</p>
              <p>奖金，1%为调节基金。</p>
              <p>第十四条  快3按不同单式投注方式设奖，均为固定奖。奖金规定如下：</p>
              <p>（一）和值投注</p>
              <p>1.和值4：单注奖金固定为80元；</p>
              <p>2.和值5：单注奖金固定为40元;</p>
              <p>3.和值6：单注奖金固定为25元；</p>
              <p>4.和值7：单注奖金固定为16元;</p>
              <p>5.和值8：单注奖金固定为12元；</p>
              <p>6.和值9：单注奖金固定为10元;</p>
              <p>7.和值10：单注奖金固定为9元；</p>
              <p>8.和值11：单注奖金固定为9元;</p>
              <p>9.和值12：单注奖金固定为10元；</p>
              <p>10.和值13：单注奖金固定为12元;</p>
              <p>11.和值14：单注奖金固定为16元；</p>
              <p>12.和值15：单注奖金固定为25元;</p>
              <p>13.和值16：单注奖金固定为40元；</p>
              <p>14.和值17：单注奖金固定为80元。</p>
              <p>（二）三同号投注</p>
              <p>1.三同号通选：单注奖金固定为40元；</p>
              <p>2.三同号单选：单注奖金固定为240元。</p>
              <p>（三）二同号投注</p>
              <p>1.二同号复选：单注奖金固定为15元；</p>
              <p>2.二同号单选：单注奖金固定为80元。</p>
              <p>（四）三不同号投注</p>
              <p>三不同号：单注奖金固定为40元。</p>
              <p>（五）二不同号投注</p>
              <p>二不同号：单注奖金固定为8元。</p>
              <p>（六）三连号通选投注</p>
              <p>三连号通选：单注奖金固定为10元。</p>
              <p>第十五条  快3设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别奖。</p>
              <p>动用调节基金设立特别奖，应报同级财政部门审核批准。</p>
              <p>第十六条  快3设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于计提奖金时，余额进入奖池；当期实际中出奖金超过</p>
              <p>计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票机构业务费垫支。在出现业务费垫支的情况下，当</p>
              <p>调节基金有资金滚入时优先偿还垫支的业务费。当奖池资金超过200万元时，超出部分自动转入调节基金。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十七条  快3采用专用电子开奖设备开奖，每期随机生成三个号码，作为当期开奖号码，每个号码为1-6共六个自然数中的任意一个。每期开奖时间为20分</p>
              <p>钟。</p>
              <p>第十八条  每期开奖后，江苏福彩机构应将开奖号码、当期销售总额、各奖级中奖情况及奖池资金余额等信息，通过新闻媒体向社会公布，并将开奖结果通</p>
              <p>知销售网点。 </p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第十九条  根据购买者选择的快3的投注号码和投注方式，与当期开奖号码的相符情况，确定相应的中奖资格。具体规定如下：</p>
              <p>（一）和值投注</p>
              <p>和值：投注号码与当期开奖号码的三个号码的和值相符，即中奖。</p>
              <p>（二）三同号投注</p>
              <p>1.三同号通选：当期开奖号码的三个号码相同，即中奖；</p>
              <p>2.三同号单选：当期开奖号码的三个号码相同，且投注号码与当期开奖号码相符，即中奖。</p>
              <p>（三）二同号投注</p>
              <p>1.二同号复选：当期开奖号码中有两个号码相同，且投注号码中的两个相同号码与当期开奖号码中两个相同号码相符，即中奖；</p>
              <p>2.二同号单选：当期开奖号码中有两个号码相同，且投注号码与当期开奖号码中两个相同号码和一个不同号码分别相符，即中奖。</p>
              <p>（四）三不同号投注</p>
              <p>三不同号投注：当期开奖号码的三个号码各不相同，且投注号码与当期开奖号码全部相符，即中奖。</p>
              <p>（五）二不同号投注</p>
              <p>二不同号投注：当期开奖号码中有两个号码不相同，且投注号码中的两个不同号码与当期开奖号码中的两个不同号码相符，即中奖。</p>
              <p>（六）三连号通选投注</p>
              <p>三连号通选：当期开奖号码为三个相连的号码（仅限：123、234、345、456），即中奖。</p>
              <p>第二十条  当期每注投注号码按其投注方式只有一次中奖机会，不能兼中兼得，特别设奖除外。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十一条  快3兑奖当期有效。中奖者应当自开奖之日起60个自然日内，持中奖彩票到指定的地点兑奖，逾期未兑视为弃奖。弃奖奖金纳入彩票公益金。</p>
              <p>第二十二条  中奖彩票为兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</p>
              <p>第二十三条  兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p class="font-size-1p5 font-weight-bold">附则 </p>
              <p>第二十四条  本规则自批准之日起执行。</p>
            </div>
            <div class="sd11x5" v-if="code === 'SD11X5'">
              <p class="text-center font-size-2p5 font-weight-bold">“十一运夺金”玩法规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条  根据财政部《彩票发行与销售管理暂行办法》（财综〔2002〕13号），制定本游戏规则。</p>
              <p>第二条  “十一运夺金”电脑体育彩票由国家体育总局体育彩票管理中心统一发行，山东省体育彩票管理中心在所辖区域内承销，采用计算机网络系统发行</p>
              <p>销售。</p>
              <p>第三条  “十一运夺金”电脑体育彩票实行自愿购买，凡购买该彩票者即视为同意并遵守本规则。</p>
              <p>第四条  不得向未成年人销售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第五条  购买“十一运夺金”电脑体育彩票时，从01（射击）、02（射箭）、03（游泳）、04（跳水）、05（田径）、06（乒乓球）、07（篮球）、</p>
              <p>08（足球）、09（举重）、10（赛艇）、11（帆船）共11个号码（比赛项目）中任选1个或多个（最多8个）号码（比赛项目）所组成的一注彩票的投注为</p>
              <p>单式投注。其中：</p>
              <p>从11个号码中任选1个号码的投注为“任选一”；</p>
              <p>选2个号码的投注分为“任选二”、“选前二”；</p>
              <p>选3个号码的投注分为“任选三”、“选前三”；</p>
              <p>选4个号码的投注为“任选四”；</p>
              <p>选5个号码的投注为“任选五”；</p>
              <p>选6个号码的投注为“任选六”；</p>
              <p>选7个号码的投注为“任选七”；</p>
              <p>选8个号码的投注为“任选八”。</p>
              <p>第六条  “选前二”、“选前三”投注方式分为直选投注和组选投注。</p>
              <p>直选投注：所选2个或3个号码与当期顺序摇出的5个号码中的前2个或3个号码一一对应进行的投注。</p>
              <p>组选投注：所选2个或3个号码与当期顺序摇出的5个号码中的前2个或3个号码不按先后，均作为一注投注号码进行的投注。</p>
              <p>第七条  除单式投注外、购买者还可进行复式投注、胆拖投注、多倍投注。</p>
              <p>复式投注是指所选号码个数超过单式投注的号码个数，按该单式投注方式组成多注彩票的投注。</p>
              <p>胆拖投注是指先选取少于单式投注号码个数的号码作为胆码（即每注彩票均包含的号码），再选取除胆码以外的号码作为拖码，胆码与拖码个数之和须多于</p>
              <p>单式投注号码个数，由胆码与拖码按该单式投注方式组成多注彩票的投注。</p>
              <p>多倍投注是指对选定结果不超过99倍的投注。</p>
              <p>第八条  单张彩票最大投注金额不超过20000元。</p>
              <p>第九条  购买者可在山东省体育彩票管理中心设置的投注站进行投注。投注号码可由投注机随机产生，也可通过投注单将购买者选定的号码输入投注机确</p>
              <p>定。投注号码经系统确认后打印出的兑奖凭证即为“十一运夺金”电脑体育彩票，交购买者保存。</p>
              <p>第十条  “十一运夺金”电脑体育彩票每期全部投注号码的可投注数量实行动态控制，如投注号码受限，则不能投注。</p>
              <p>第十一条  若因销售终端故障、通讯线路故障和投注站信用额度受限等原因造成投注不成功，应退还投注者投注金额。</p>
              <p>第十二条  “十一运夺金”电脑体育彩票每注2元人民币。彩票不记名、不挂失、不返还本金、不流通使用.</p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十三条  “十一运夺金”电脑体育彩票按每期销售总额的59%、13%、28%计提奖金、发行费和公益金。</p>
              <p>第十四条  “十一运夺金”电脑体育彩票按不同单式投注方式设奖，均为固定奖。奖金规定如下：</p>
              <p>任选一中1，单注固定奖金13元。</p>
              <p>任选二中2，单注固定奖金6元；</p>
              <p>选前二组选，单注固定奖金65元；</p>
              <p>选前二直选，单注固定奖金130元。</p>
              <p>任选三中3，单注固定奖金19元；</p>
              <p>选前三组选，单注固定奖金195元；</p>
              <p>选前三直选，单注固定奖金1170元。</p>
              <p>任选四中4，单注固定奖金78元。</p>
              <p>任选五中5，单注固定奖金540元。</p>
              <p>任选六中5，单注固定奖金90元。</p>
              <p>任选七中5，单注固定奖金26元。</p>
              <p>任选八中5，单注固定奖金9元。</p>
              <p>第十五条  “十一运夺金”电脑体育彩票设置奖池，奖池由当期计提奖金与实际中出奖金的差额累计而成。若当期计提奖金大于当期实际中出奖金时，余额</p>
              <p>滚入奖池；若当期计提奖金小于当期实际中出奖金时，差额用奖池补足；若奖池资金不足时，用调节基金补足，调节基金不足时，从发行经费中垫支</p>
              <p>第十六条  调节基金包括弃奖收入和逾期未退票的票款。调节基金专项用于支付各种不可预见情况下的奖金支出风险以及设立特别奖。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十七条  “十一运夺金”电脑体育彩票每20分钟销售一个奖期。</p>
              <p>第十八条  “十一运夺金”电脑体育彩票每期开奖结果通过随机数码生成器，从01-11共11个号码中按顺序自动生成5个不同号码作为当期中奖号码。</p>
              <p>第十九条  每期开奖结果通过视频等方式及时通知各销售终端。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第二十条  所购彩票与当期开奖结果对照，符合以下情况即为中奖。</p>
              <p>任选一中1：投注的1个号码与当期顺序摇出的5个号码中的第1个号码相同，则中奖。</p>
              <p>任选二中2：投注的2个号码与当期摇出的5个号码中的任2个号码相同，则中奖。</p>
              <p>选前二组选：投注的2个号码与当期顺序摇出的5个号码中的前2个号码相同，则中奖。</p>
              <p>选前二直选：投注的2个号码与当期顺序摇出的5个号码中的前2个号码相同且顺序一致，则中奖。</p>
              <p>任选三中3：投注的3个号码与当期摇出的5个号码中的任3个号码相同，则中奖。</p>
              <p>选前三组选：投注的3个号码与当期顺序摇出的5个号码中的前3个号码相同，则中奖。</p>
              <p>选前三直选：投注的3个号码与当期顺序摇出的5个号码中的前3个号码相同且顺序一致，则中奖。</p>
              <p>任选四中4：投注的4个号码与当期摇出的5个号码中的任4个号码相同，则中奖。</p>
              <p>任选五中5：投注的5个号码与当期摇出的5个号码相同，则中奖。</p>
              <p>任选六中5：投注的6个号码中任5个号码与当期摇出的5个号码相同，则中奖。</p>
              <p>任选七中5：投注的7个号码中任5个号码与当期摇出的5个号码相同，则中奖。</p>
              <p>任选八中5：投注的8个号码中任5个号码与当期摇出的5个号码相同，则中奖。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖 </p>
              <p>第二十一条  “十一运夺金”电脑体育彩票兑奖当期有效。每期自开奖之日起28天为兑奖期，逾期未兑视为弃奖，弃奖奖金纳入调节基金。</p>
              <p>第二十二条  中奖彩票为兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</p>
              <p>第二十三条  兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p>第二十四条  凡伪造、涂改中奖彩票，冒领奖金者，送交司法机关追究法律责任。</p>
              <p class="font-size-1p5 font-weight-bold">附则</p>
              <p>第二十五条  本游戏规则解释权属国家体育总局体育彩票管理中心。</p>
              <p>第二十六条  本游戏规则自发布之日起执行。</p>
            </div>
            <div class="cqxync" v-if="code === 'CQXYNC'">
              <p class="text-center font-size-2p5 font-weight-bold">幸运农场游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条 根据《彩票管理条例》（国务院令第554号）等有关规定，制定本规则。</p>
              <p>第二条 中国福利彩票快乐十分（以下称“快乐十分”）由中国福利彩票发行管理中心组织发行，由广东省、重庆市福利彩票发行中心（以下称广东、重庆福</p>
              <p>彩中心）在所辖区域内承销</p>
              <p>第三条 快乐十分采用计算机网络系统发行销售，定期开奖。</p>
              <p>第四条 快乐十分实行自愿购买，凡购票者均被视为同意并遵守本规则</p>
              <p>第五条 不得向未成年人出售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注 </p>
              <p>快乐十分是指从01至20个号码中任意选择1－5个号码组合为一注彩票进行的投注；每注金额人民币2元。</p>
              <p>第七条 快乐十分按期销售。销售期号按销售日以开奖时间顺序编排，按日历年度和开奖顺序编排。</p>
              <p>第八条 投注者可在广东、重庆福彩中心设置的任何一个快乐十分投注站投注。投注者可选择机选号码投注或者自选号码投注，机选号码投注即由投注机随机</p>
              <p>产生投注号码进行投注，自选号码投注即将投注者选定的号码输入投注机进行投注。</p>
              <p>第九条 快乐十分采取有纸化投注，投注号码经投注机打印出对奖凭证，交投注者保存，此对奖凭证即为快乐十分彩票。</p>
              <p>第十条 快乐十分根据投注号码个数分为选一、选二、选三、选四、选五投注，具体方式如下：</p>
              <p>选一投注：是指从01至20个号码中任意选择1个号码进行投注。对01至20个号码进行规定，01至18为数字号码，19和20为红色号码，分为如下两种投注方</p>
              <p>式：</p>
              <p>1、选一数投(果蔬单选)：是指从01至18中任意选择1个数字号码，对开奖号码中按开奖顺序出现的第一个位置的投注；</p>
              <p> 2、选一红投(动物单选)：是指从19和20中任意选择1个红色号码，对开奖号码中按开奖顺序出现的第一 个位置的投注。</p>
              <p>选二投注：是指从01至20中任意选择2个号码进行投注，具体分为：</p>
              <p> 1、选二任选(幸运二)：是指对开奖号码中任意2个位置的投注；</p>
              <p> 2、选二连组(背靠背)：是指对开奖号码中按开奖顺序出现的2个连续位置的投注；</p>
              <p> 3、选二连直(连连中)：是指对开奖号码中按开奖顺序出现的2个连续位置按位相符的投注。</p>
              <p>选三投注：是指从01至20中任意选择3个号码进行投注，具体分为：</p>
              <p> 1、选三任选(幸运三)：是指对开奖号码中任意3个位置的投注；</p>
              <p> 2、选三前组(三全中)：是指对开奖号码中按开奖顺序出现的前3个连续位置的投注；</p>
              <p> 3、选三前直(三连中)：是指对开奖号码中按开奖顺序出现的前3个连续位置按位相符的投注。</p>
              <p>选四投注(幸运四)：是指从01至20中任意选择4个号码，对开奖号码中任意4个位置的投注。</p>
              <p>选五投注(幸运五)：是指从01至20中任意选择5个号码，对开奖号码中任意5个位置的投注。</p>
              <p>第十一条 投注方法分为单式投注、复式投注、胆拖投注和多倍投注。</p>
              <p> 1、单式投注是从20个号码中选择1个至5个号码为一注的投注，单式投注时每张彩票可打印1至5注号码。</p>
              <p>2、复式投注是指所选号码个数超过单式投注的号码个数，按该单式投注组合方式组成多注彩票的投注。</p>
              <p> 3、胆拖投注是指先选取少于单式投注号码个数的号码作为胆码（即每注彩票均包含的号码），再选取除胆码以外的号码作为拖码，胆码与拖码个数之和须</p>
              <p>多于单式投注号码个数，由胆码与拖码按该单式投注方法组成多注彩票的投注。</p>
              <p>4、多倍投注是指每张彩票对选定结果不超过100倍的投注。</p>
              <p>第十二条 投注期限可分为当期投注和多期投注。当期投注是指只购买当期彩票；多期投注是指购买本销售日内从当期起连续若干期的彩票。</p>
              <p>第十三条 快乐十分当期每组号码的投注注数，根据市场情况实行限量销售措施，由广东、重庆福彩中心根据实际情况确定具体限额报同级财政部门审核批准</p>
              <p>后执行。 </p>
              <p class="font-size-1p5 font-weight-bold">设奖 </p>
              <p>第十四条 快乐十分按当期销售总额的59%、13%和28%分别计提彩票奖金、彩票发行经费和彩票公益金。彩票奖金中，当期奖金58%，调节基金1%。</p>
              <p>第十五条 快乐十分采用固定奖金设奖，按所设奖金等级兑奖。具体设奖如下： </p>
              <p>选一投注</p>
              <p>1、选一数投中一(果蔬单选)：单注奖金固定为25元；</p>
              <p>2、选一红投中一(动物单选)：单注奖金固定为5元。</p>
              <p>选二投注</p>
              <p>1、选二任选中二(幸运二)：单注奖金固定为8元；</p>
              <p>2、选二连组中二(背靠背)：单注奖金固定为31元；</p>
              <p>3、选二连直中二(连连中)：单注奖金固定为62元。</p>
              <p>选三投注</p>
              <p>1、选三任选中三(幸运三)：单注奖金固定为24元；</p>
              <p>2、选三前组中三(三全中)：单注奖金固定为1300元；</p>
              <p>3、选三前直中三(三连中)：单注奖金固定为8000元。</p>
              <p>选四投注</p>
              <p>选四任选中四(幸运四)：单注奖金固定为80元。</p>
              <p>选五投注</p>
              <p>选五任选中五(幸运五)：单注奖金固定为320元。</p>
              <p>第十六条 快乐十分设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于计提奖金时，余额进入奖池；当期实际中出奖金</p>
              <p>超过计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票发行经费垫支。</p>
              <p>第十七条 快乐十分设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付可预见的奖金支出风险，以及设立特别</p>
              <p>奖。广东、重庆福彩中心动用调节基金设立特别奖，应报同级 财政部门审核批准。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十八条 快乐十分采用专用电子开奖设备开奖，每期从01至20共20个号码中随机生成8个不同号码，作为当期开奖号码。“快乐十分”每隔20分钟开奖一</p>
              <p>次，开奖号码通过与数据中心连接的视频设备显示。</p>
              <p>第十九条 每期开奖统计数据以广东、重庆福彩中心数据中心收到的销售有效数据为准，并在开奖前，将其全部数据通过国家认可的CA中心提供的签名算法</p>
              <p>生成签名数据，并硬拷贝到打印纸上。每天将当日所有数据刻入不可改写的光盘，并将当日所有数据提交公证处备查。</p>
              <p>第二十条 每期开奖后，将当期销售总额、开奖号码和各奖等中奖注数、金额，通过投注站或者新闻媒体及时向 社会公布。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第二十一条 快乐十分根据投注号码与开奖号码相符情况确定相应中奖资格，具体为：</p>
              <p>选一投注</p>
              <p>1、选一数投中一(果蔬单选)：投注号码与开奖号码中按开奖顺序出现的第一个位置数字号码相符，即中奖；</p>
              <p>2、选一红投中一(动物单选)：投注号码与开奖号码中按开奖顺序出现的第一个位置为红色号码，即中奖。</p>
              <p>选二投注</p>
              <p>1、选二任选中二(幸运二)：投注号码与开奖号码中任意2个位置的号码相符，即中奖；</p>
              <p>2、选二连组中二(背靠背)：投注号码与开奖号码中按开奖顺序出现的2个连续位置的号码相符（顺序不限），即中奖；</p>
              <p>3、选二连直中二(连连中)：投注号码与开奖号码中按开奖顺序出现的2个连续位置的号码按位相符，即中奖。</p>
              <p>选三投注</p>
              <p>1、选三任选中三(幸运三)：投注号码与开奖号码中任意3个位置的号码相符，即中奖；</p>
              <p>2、选三前组中三(三全中)：投注号码与开奖号码中按开奖顺序出现的前3个位置的号码相符（顺序不限），即中奖；</p>
              <p>3、选三前直中三(三连中)：投注号码与开奖号码中按开奖顺序出现的前3个位置的号码按位相符，即中奖。</p>
              <p>选四投注</p>
              <p>选四任选中四(幸运四)：投注号码与开奖号码中任意4个位置的号码相符，即中奖。</p>
              <p>选五投注</p>
              <p>五任选中五(幸运五)：投注号码与开奖号码中任意5个位置的号码相符，即中奖。</p>
              <p>第二十二条 当期每注投注号码只有一次中奖机会，不能兼中兼得，特别设奖除外。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖 </p>
              <p>第二十三条 快乐十分兑奖当期有效。每期开奖之日起60个自然日为兑奖期，逾期未兑奖者视为弃奖，弃奖奖金纳入彩票公益金。</p>
              <p>第二十四条 中奖彩票是兑奖凭证。中奖彩票因玷污、损坏等原因而不能正确识别的，不能兑奖。</p>
              <p>第二十五条 兑奖事宜由广东、重庆福彩中心根据兑奖管理办法执行，具体明确投注站、地市福彩中心和省福彩中心的兑奖额度。</p>
              <p>第二十六条 兑奖机构有权查验中奖者的中奖凭证和有效身份证件，兑奖者应予配合。凡冒领奖金者，送交司法机关追究法律责任。</p>
              <p>第二十七条 本规则自批准之日起执行。 </p>
              <p>备注：“农场宝贝”与开奖号码对应图：</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="5">大型水果</td>
                    <td colspan="5">小型水果</td>
                  </tr>
                  <tr>
                    <td class="backgrond-yellow">1</td>
                    <td class="backgrond-yellow">2</td>
                    <td class="backgrond-yellow">3</td>
                    <td class="backgrond-yellow">4</td>
                    <td class="backgrond-yellow">5</td>
                    <td class="backgrond-pink">6</td>
                    <td class="backgrond-pink">7</td>
                    <td class="backgrond-pink">8</td>
                    <td class="backgrond-pink">9</td>
                    <td class="backgrond-pink">10</td>
                  </tr>
                  <tr>
                    <td class="backgrond-yellow">西瓜</td>
                    <td class="backgrond-yellow">椰子</td>
                    <td class="backgrond-yellow">榴莲</td>
                    <td class="backgrond-yellow">柚子</td>
                    <td class="backgrond-yellow">菠萝</td>
                    <td class="backgrond-pink">葡萄</td>
                    <td class="backgrond-pink">荔枝</td>
                    <td class="backgrond-pink">殷桃</td>
                    <td class="backgrond-pink">草莓</td>
                    <td class="backgrond-pink">潘茄</td>
                  </tr>
                  <tr>
                    <td colspan="4">中型水果</td>
                    <td colspan="4">蔬菜</td>
                    <td colspan="2">农场动物</td>
                  </tr>
                  <tr>
                    <td class="backgrond-green">11</td>
                    <td class="backgrond-green">12</td>
                    <td class="backgrond-green">13</td>
                    <td class="backgrond-green">14</td>
                    <td class="backgrond-army-green">15</td>
                    <td class="backgrond-army-green">16</td>
                    <td class="backgrond-army-green">17</td>
                    <td class="backgrond-army-green">18</td>
                    <td class="backgrond-deep-yellow">19</td>
                    <td class="backgrond-deep-yellow">20</td>
                  </tr>
                  <tr>
                    <td class="backgrond-green">梨子</td>
                    <td class="backgrond-green">苹果</td>
                    <td class="backgrond-green">桃子</td>
                    <td class="backgrond-green">柑桔</td>
                    <td class="backgrond-army-green">冬瓜</td>
                    <td class="backgrond-army-green">萝卜</td>
                    <td class="backgrond-army-green">南瓜</td>
                    <td class="backgrond-army-green">茄子</td>
                    <td class="backgrond-deep-yellow">家犬</td>
                    <td class="backgrond-deep-yellow">奶牛</td>
                  </tr>
                </tbody>
              </table>
            </div>
            <div class="k3" v-if="code === 'K3'">快3</div>
            <div class="11x5" v-if="code === '11X5'">11选5</div>
            <div class="bjkl8" v-if="code === 'BJKL8'">北京快乐8</div>
            <div class="pcdd" v-if="code === 'PCDD'">PC蛋蛋</div>
            <div class="fc3d" v-if="code === 'FC3D'">福彩3D</div>
            <div class="twbg" v-if="code === 'TWBG'">台湾宾果</div>
          </div>
        </main>
      </Col>
    </Row>
    <Footer />
  </div>
</template>
<style scoped lang="scss">
@import 'Index-scoped.scss';

</style>

<script lang="ts">
import {
  Component,
  Watch,
  Vue,
} from 'vue-property-decorator';

import {
  warn,
} from 'vue-class-component/lib/util';

import {
  Header,
  NavTop,
  NavRight,
  Footer,
} from '@/Commons/';

import {
  LOTTERIES,
  BACKEND,
} from '@/CONFIGS/';


@Component({
  name: 'Rule',
  components: {
    Header,
    NavTop,
    NavRight,
    Footer,
  },
})
class Rule extends Vue {
  public code: string = 'BJPK10';
  public created(): void {
   this.$router.replace({ path: '/rule/', query: { code: 'BJPK10'}});
  }
  public changeLottery(sCode: string) {
    this.code = sCode;
    let oQuery = {
      code: sCode,
    };
    this.$router.replace({ path: '/rule/', query: oQuery });
  }

}

export default Rule;
</script>
