<template>
  <div class="page rule">
    <Header />
    <NavTop/>
    <NavRight />
    <Row :gutter="0" class="backgrond-mian">
      <Col 
        :xs="{span: 22, offset: 1}" 
        :sm="{span: 20, offset: 2}" 
        :md="{span: 20, offset: 2}" 
        :lg="{span: 20, offset: 2}"
        :xl="{span: 16, offset: 4}">
        <div class="rule-head">首页&nbsp;&gt;
          <span v-if="iNumber === 1">北京PK10</span>
          <span v-if="iNumber === 2">重庆时时彩</span>
          <span v-if="iNumber === 3">新疆时时彩</span>
          <span v-if="iNumber === 4">天津时时彩</span>
          <span v-if="iNumber === 5">广东快乐十分</span>
          <span v-if="iNumber === 6">广东11选5</span>
          <span v-if="iNumber === 7">江苏快3</span>
          <span v-if="iNumber === 8">十一运夺金</span>
          <span v-if="iNumber === 9">重庆辛运农场</span>
          <span v-if="iNumber === 10">快3</span>
          <span v-if="iNumber === 11">11选5</span>
          <span v-if="iNumber === 12">北京快乐8</span>
          <span v-if="iNumber === 13">PC蛋蛋</span>
          <span v-if="iNumber === 14">福彩3D</span>
          <span v-if="iNumber === 15">台湾宾果</span>
        </div>
        <div class="rule-content w-100 d-flex">
          <div class="lottery-menu">
            <ul class="font-weight-bold font-size-1p5">
              <li class="font-size-2">玩法规则</li>
              <li :class=" iNumber === 1 ? 'background-li':'' " @click="toggleLottery(1)">北京PK10</li>
              <li :class=" iNumber === 2 ? 'background-li':'' " @click="toggleLottery(2)">重庆时时彩</li>
              <li :class=" iNumber === 3 ? 'background-li':'' " @click="toggleLottery(3)">新疆时时彩</li>
              <li :class=" iNumber === 4 ? 'background-li':'' " @click="toggleLottery(4)">天津时时彩</li>
              <li :class=" iNumber === 5 ? 'background-li':'' " @click="toggleLottery(5)">广东快乐十分</li>
              <li :class=" iNumber === 6 ? 'background-li':'' " @click="toggleLottery(6)">广东11选5</li>
              <li :class=" iNumber === 7 ? 'background-li':'' " @click="toggleLottery(7)">江苏快3</li>
              <li :class=" iNumber === 8 ? 'background-il':'' " @click="toggleLottery(8)">十一运夺金</li>
              <li :class=" iNumber === 9 ? 'background-li':'' " @click="toggleLottery(9)">重庆辛运农场</li>
              <li :class=" iNumber === 10 ? 'background-li':'' " @click="toggleLottery(10)">快3</li>
              <li :class=" iNumber === 11 ? 'background-li':'' " @click="toggleLottery(11)">11选5</li>
              <li :class=" iNumber === 12 ? 'background-li':'' " @click="toggleLottery(12)">北京快乐8</li>
              <li :class=" iNumber === 13 ? 'background-li':'' " @click="toggleLottery(13)">PC蛋蛋</li>
              <li :class=" iNumber === 14 ? 'background-li':'' " @click="toggleLottery(14)">福彩3D</li>
              <li :class=" iNumber === 15 ? 'background-li':'' " @click="toggleLottery(15)">台湾宾果</li>
            </ul>
          </div>
          <div class="rule-details mb-2 background-white ml-3">
            <div class="rule-pk10" v-if="iNumber === 1">
              <p class="text-center font-size-2p5 font-weight-bold">“PK10”游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条　根据《彩票管理条例》、《彩票管理条例实施细则》、《彩票发行销售管理办法》（财综[2012]102号）等有关规定，制定本规则。
              <p>第二条　中国福利彩票PK10游戏(以下简称PK10）由中国福利彩票发行管理中心发行和组织销售，由北京市福利彩票销售机构（以下称北京福彩机构）在所</p>  
              <p>辖区域内销售。</p>
              <p>第三条　PK10采用计算机网络系统发行，在北京福彩机构设置的销售网点销售，定期开奖。</p>
              <p>第四条　PK10实行自愿购买，凡购买者均被视为同意并遵守本规则。</p>
              <p>第五条　不得向未成年人销售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条　PK10采用排列式玩法。从左至右共有十个投注位置，排列顺序分别为一至十号位置，每个位置可从1-10的自然数中选择一个号码。投注者先选择。</p>
              <p>投注位置个数，投注位置个数最少一个、最多十个；然后按照从左至右的顺序，必须从一号位置开始，在每个位置上从1-10的自然数中选择一个号码进行投</p>
              <p>注；若投注位置个数超过两个的，后选位置的投注号码不能与前面所有已选位置的投注号码相同。投注者所选号码按位置顺序排序组成一组号码，该组号码</p>
              <p>即为一注PK10投注号码。每注金额人民币2元。购买者可对其选定的投注号码进行多倍投注，投注倍数为2、3、4、5、10。单张彩票的投注金额不得超过</p>
              <p>20000元。</p>
              <p>第七条　购买者可在北京福彩机构设置的销售网点投注。投注号码经投注机打印出兑奖凭证，交购买者保存，此兑奖凭证即为PK10彩票。</p>
              <p>第八条　PK10设置“普通”、“精确”、“精确组选”、“位置”、“拖拉机”、“猜奇偶”、“猜大小”以及“和数”投注方式，具体规定如下：</p>
              <p>（一）普通投注：从一号位置开始，选择最少一个、最多十个位置，每个位置上从1-10的自然数中选择一个号码，投注位置个数超过两个的，后选位置的投</p>
              <p>注号码不能与前面所有已选位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（二）精确投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有已选</p>
              <p>位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（三）精确组选投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有</p>
              <p>已选位置的投注号码相同，将选定位置上的号码的所有排列方式作为一注投注号码进行投注。</p>
              <p>（四）位置投注：从一至三号位置中，选择一个或二个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面已选位置的投</p>
              <p>注号码相同，将选定的一个或二个号码作为一注投注号码进行投注。</p>
              <p>（五）拖拉机投注：以一至三号位置上的开奖号码是否是一个连续的三位数字（升序或降序）作为投注结果进行投注。</p>
              <p>（六）猜奇偶投注：以一至三号位置上的开奖号码是否全部是奇数或偶数作为投注结果进行投注。“猜奇偶”投注又分为“全偶”和“全奇”两种投注。</p>
              <p>（七）猜大小投注：以一至三号位置上的开奖号码的三个数字之和的数值大小作为投注结果进行投注。“猜大小”投注又分为“猜大”和“猜小”两种投</p>
              <p>注。</p>
              <p>（八）和数投注：以一至三号位置上的开奖号码的三个数字之和的数值作为投注结果进行投注。</p>
              <p>第九条 购买者可选择机选号码投注、自选号码投注。机选号码投注是指由投注机随机产生投注号码进行投注，自选号码投注是指将购买者选定的号码输入投</p>
              <p>注机进行投注。</p>
              <p>第十条 购买者可选择多期投注。多期投注是指购买从当期起连续不超过12期的彩票。</p>
              <p>第十一条 PK10每期销售时间为20分钟。销售期号按每期开奖顺序编排。</p>
              <p>第十二条 PK10每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。若因销售终端故障、通讯线路故障和销售网点信用额度受限</p>
              <p>等原因造成投注不成功，应退还购买者投注金额。</p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十三条 PK10按当期销售额的50%、15%和35%分别计提彩票奖金、彩票发行费和彩票公益金。彩票奖金分为当期奖金和调节基金，其中，49%为当期奖</p>
              <p>金，1%为调节基金。</p>
              <p>第十四条 PK10按照不同投注方式分别设奖。具体设奖如下：</p>
              <p>（一）普通投注</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>匹配个数</td>
                    <td>选10</td>
                    <td>选9</td>
                    <td>选8</td>
                    <td>选7</td>
                    <td>选6</td>
                    <td>选5</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                    <td>选1</td>
                  </tr>
                  <tr>
                    <td>10</td>
                    <td>888888</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>9</td>
                    <td>-</td>
                    <td>80000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>8</td>
                    <td>-</td>
                    <td>10000</td>
                    <td>40000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>7</td>
                    <td>-</td>
                    <td>5000</td>
                    <td>2000</td>
                    <td>20000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>6</td>
                    <td>-</td>
                    <td>250</td>
                    <td>500</td>
                    <td>4500</td>
                    <td>10000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>5</td>
                    <td>-</td>
                    <td>50</td>
                    <td>100</td>
                    <td>400</td>
                    <td>2000</td>
                    <td>500</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>4</td>
                    <td>-</td>
                    <td>10</td>
                    <td>20</td>
                    <td>25</td>
                    <td>100</td>
                    <td>30</td>
                    <td>350</td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>3</td>
                    <td>-</td>
                    <td>5</td>
                    <td>10</td>
                    <td>10</td>
                    <td>10</td>
                    <td>8</td>
                    <td>20</td>
                    <td>160</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>1</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>10</td>
                  </tr>
                  <tr>
                    <td>0</td>
                    <td>2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                  </tr>
                </tbody>
              </table>
              <p>（二）精确投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">匹配个数</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">4</td>
                    <td>5000</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">3</td>
                    <td>-</td>
                    <td>700</td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>90</td>
                  </tr>
                </tbody>
              </table>
              <p>（三）精确组选投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">投注方式</td>
                    <td>组选4</td>
                    <td>组选3</td>
                    <td>组选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">中奖金额(元/注)</td>
                    <td>205</td>
                    <td>118</td>
                    <td>44</td>
                  </tr>
                </tbody>
              </table>
              <p>（四）位置、拖拉机、猜奇偶、猜大小、和数投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="3">投注方式</td>
                    <td colspan="2">中奖金额</td>
                  </tr>
                  <tr>
                    <td  colspan="2" rowspan="2"><span class="position-relative">位置投注</span></td>
                    <td>位置1</td>
                    <td colspan="2">3</td>
                  </tr>
                  <tr>
                    <td>位置2</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td colspan="3">拖拉机投注</td>
                    <td colspan="2">44</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜奇偶投注</span></td>
                    <td>全偶</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td>全寄</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜大小投注</span></td>
                    <td>猜大</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td>猜小</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="22"><span class="sum-bet position-relative">和数投注</span></td>
                    <td>和数6</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数7</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数8</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数9</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数10</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数11</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数12</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数13</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数14</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数15</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数16</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数17</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数18</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数19</td>
                    <td>13</td>
                  </tr>
                  <tr>
                    <td>和数20</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数21</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数22</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数23</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数24</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数25</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数26</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数27</td>
                    <td colspan="2">118</td>
                  </tr>
                </tbody>
              </table>
              <p>第十五条 PK10设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别奖。</p>
              <p>动用调节基金设立特别奖，应报同级财政部门审核批准</p>
              <p>第十六条 PK10设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于当期计提奖金时，余额进入奖池；当期实际中出奖</p>
              <p>金超过当期计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票兑奖周转金垫支。在出现彩票兑奖周转</p>
              <p>金垫支的情况下，当调节基金有资金滚入时优先偿还垫支的彩票兑奖周转金。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十七条 PK10采用专用电子开奖设备开奖。每期开奖时按照从左至右的顺序进行，第一个开出的号码对应一号位置，第二个开出的号码对应二号位置，依</p>
              <p>次类推，直到开出对应十号位置的号码为止，这十个位置对应的号码排列组成当期开奖号码。每期开奖时间为20分钟。</p>
              <p>第十八条 每期开奖后，北京福彩机构应向社会公布开奖号码、当期销售总额、各奖级中奖情况及奖池资金余额等信息，并将开奖结果通知销售网点。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第十九条 根据购买者选择的PK10的投注号码和投注方式与当期开奖号码按数位顺序的相符情况，确定相应的中奖资格。具体规定如下：</p>
              <p>（一）普通投注</p>
              <p>投注一个位置：投注号码与对应位置的开奖号码完全相同，即选一中一，中奖10元。</p>
              <p>投注两个位置：投注号码与对应位置的两个开奖号码完全相同，即选二中二，中奖55元；其中任意一个相同，即选二中一，中奖2元。</p>
              <p>投注三个位置：投注号码与对应位置的三个开奖号码完全相同，即选三中三，中奖160元；其中任意两个相同，即选三中二，中奖10元；其中任意一个相</p>
              <p>同，即选三中一，中奖2元。</p>
              <p>投注四个位置：投注号码与对应位置的四个开奖号码完全相同，即选四中四，中奖350元；其中任意三个相同，即选四中三，中奖20元；其中任意两个相</p>
              <p>同，即选四中二，中奖5元；其中任意一个相同，即选四中一，中奖2元。</p>
              <p>投注五个位置：投注号码与对应位置的五个开奖号码完全相同，即选五中五，中奖500元；其中任意四个相同，即选五中四，中奖30元；其中任意三个相</p>
              <p>同，即选五中三，中奖8元；其中任意两个相同，即选五中二，中奖3元；其中任意一个相同，即选五中一，中奖2元。</p>
              <p>投注六个位置：投注号码与对应位置的六个开奖号码完全相同，即选六中六，中奖10000元；其中任意五个相同，即选六中五，中奖2000元；其中任意四个</p>
              <p>相同，即选六中四，中奖100元；其中任意三个相同，即选六中三，中奖10元；其中任意两个相同，即选六中二，中奖2元。</p>
              <p>投注七个位置：投注号码与对应位置的七个开奖号码完全相同，即选七中七，中奖20000元；其中任意六个相同，即选七中六，中奖4500元；其中任意五个</p>
              <p>相同，即选七中五，中奖400元；其中任意四个相同，即选七中四，中奖25元；其中任意三个相同，即选七中三，中奖10元；其中任意两个相同，即选七中</p>
              <p>二，中奖2元。</p>
              <p>投注八个位置：投注号码与对应位置的八个开奖号码完全相同，即选八中八，中奖40000元；其中任意七个相同，即选八中七，中奖2000元；其中任意六个</p>
              <p>相同，即选八中六，中奖500元；其中任意五个相同，即选八中五，中奖100元；其中任意四个相同，即选八中四，中奖20元；其中任意三个相同，即选八</p>
              <p>中三，中奖10元；其中任意两个相同，即选八中二，中奖2元。</p>
              <p>投注九个位置：投注号码与对应位置的九个开奖号码完全相同，即选九中九，中奖80000元；其中任意八个相同，即选九中八，中奖10000元；其中任意七</p>
              <p>个相同，即选九中七，中奖5000元；其中任意六个相同，即选九中六，中奖250元；其中任意五个相同，即选九中五，中奖50元；其中任意四个相同，即选</p>
              <p>九中四，中奖10元；其中任意三个相同，即选九中三，中奖5元；其中任意两个相同，即选九中二，中奖2元。</p>
              <p>投注十个位置：投注号码与对应位置的十个开奖号码完全相同，即选十中十，中奖888888元；投注号码与对应位置的十个开奖号码全部不同，中奖2元。</p>
              <p>（二）精确投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码完全相同，即选二中二，中奖90元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码完全相同，即选三中三，中奖700元</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码完全相同，即选四中四，中奖5000元。</p>
              <p>（三）精确组选投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码不按先后顺序一一对应，即中精确组选2奖，中奖44元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码不按先后顺序一一对应，即中精确组选3奖，中奖118元。</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码不按先后顺序一一对应，即中精确组选4奖，中奖205元。</p>
              <p>（四）位置投注</p>
              <p>位置1：投注号码与一至三号位置中任意一个位置上的开奖号码相同，即中奖3元；</p>
              <p>位置2：投注号码与一至三号位置中任意两个位置上的开奖号码不按先后顺序一一对应，即中奖15元。</p>
              <p>（五）拖拉机投注</p>
              <p>一至三号位置上的三个开奖号码按照升序或降序排列成连续的三位数字（“9-10-1”和“1-10-9”、“10-1-2”和“2-1-10”除外），即中奖44元。</p>
              <p>（六）猜奇偶投注</p>
              <p>全偶：一至三号位置上的三个开奖号码全部为偶数，即中奖12元。</p>
              <p>全奇：一至三号位置上的三个开奖号码全部为奇数，即中奖12元。</p>
              <p>（七）猜大小投注</p>
              <p>猜大：一至三号位置上开奖号码的三个数字之和介于21（含）和27（含）之间，即中奖5元；</p>
              <p>猜小：一至三号位置上开奖号码的三个数字之和介于6（含）和12（含）之间，即中奖5元。</p>
              <p>（八）和数投注</p>
              <p>投注号码与一至三号位置上开奖号码的三个数字之和相同，即中奖。</p>
              <p>第二十条 当期每注投注号码只有一次中奖机会，按其投注方式中得匹配号码最多的奖等，不能兼中兼得，特别设奖除外。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十一条 PK10兑奖期当期有效。中奖者应当自开奖之日起60个自然日内，持中奖彩票到指定的地点兑奖。逾期未兑奖视为弃奖，弃奖奖金纳入彩票公益</p>
              <p>金。</p>
              <p>第二十二条 中奖彩票是兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</p>
              <p>第二十三条 兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p class="font-size-1p5 font-weight-bold">附则</p>
              <p>第二十四条 本规则自批准之日起执行。</p>
            </div>
            <div class="rule-cqssc" v-if="iNumber === 2">
              <p class="text-center font-size-2p5 font-weight-bold">重庆欢乐生肖玩法规则</p>
              <p>1.“生肖”动物十选一，选中即中奖，每20分钟开奖一次。</p>
              <p>2.“欢乐生肖”游戏共设5种颜色开奖区域，10种生肖</p>
              <p class="ml-2">5种颜色分别为：紫区、黄区、蓝区、红区、绿区</p>
              <p class="ml-2">10种生肖分别为：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪</p>
              <p>「欢乐生肖」与「时时彩」对比：</p>
              <p class="ml-2">「欢乐生肖」生肖：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪分别对应</p>
              <p class="ml-2">「时时彩 」数字： 0、 1、 2、 3、 4、 5、 6、 7、 8、 9</p>
              <p class="ml-2">「欢乐生肖」颜色：  紫、黄、蓝、红、绿分别对应</p>
              <p class="ml-2">「时时彩」开奖区域：万、千、百、十、个位开奖区域</p>
              <p>4.①欢乐生肖有欢乐一、欢乐二、欢乐三、欢乐五 四种玩法</p>
              <p class="ml-2">欢乐一：投注绿色区域，单注投注金额2元，单注奖金10元。</p>
              <p class="ml-2">欢乐二：投注红色和绿色区域，单注投注金额2元，单注奖金100元。</p>
              <p class="ml-2">欢乐三：投注蓝色、红色和绿色区域，单注投注金额2元，单注奖金1000元。</p>
              <p class="ml-2">欢乐五：投注紫色、黄色、蓝色、红色和绿色区域，单注投注金额2元，单注奖金     100000元</p>
              <p>②欢乐生肖有欢乐组合二、欢乐组合三、欢乐组合五 三种组合玩法</p>
              <p class="ml-2">欢乐二组合：投注红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中红色、绿色区域，获得奖</p>
              <p>金100元。</p>
              <p class="ml-2">欢乐三组合：投注蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中蓝色、红色、绿色</p>
              <p>区域，获得奖金1000元。</p>
              <p class="ml-2">欢乐五组合：投注紫色、黄色、蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中紫</p>
              <p>色、黄色、蓝色、红色、绿色区域，获得奖金100000元。</p>
              <p class="font-size-2p1font-weight-bold">投注</p>
              <p>1、投注者可在全市所有经市福利彩票发行中心批准、并展示《中国福利彩票“时时彩”销售许可证》的投注站投注。</p>
              <p>2、投注者可选择电话投注或投注卡、银行卡投注，并遵守相应规范。</p>
              <p>3、按不同游戏，投注方法可分自选和机选生肖投注；单倍和多倍投注。</p>
              <p>4、通过投注单投注时，按照投注单上的要求及所示方法正确填涂。
              <p>5、投注生肖经投注机确认，打印在“时时彩”电脑福利彩票上，作为对奖凭证，交投注者</p>
              <p>6、每注投注金额为人民币2元，每张彩票可打印1—5注投注生肖，投注者可选择多倍投注。</p>
              <p>7、投注前彩民应对投注进行确认，彩票售出后不得退换。</p>
              <p>8、如因投注机或通讯故障，投注站销售金额受限等原因造成投注不成功，投注站应立即退还相应收取的投注金额，彩民可选择到其它</p>
              <p>投注站投注或电话投注的方式。如使用卡投注，系统将在一个工作日内返回相应投注款。</p>
              <p>9、每期的每个投注生肖的投注注数，根据市场销售情况限量发行。如投注生肖受限，投注不能成功，属时时彩游戏规则规定的正常运</p>
              <p>行情况，投注者只能在该生肖恢复销售后继续投注。</p>
              <p>11、未成年人不得参与投注。</p>
              <p class="font-size-2p1 font-weight-bold">设奖</p>
              <p>1、每期销售总额的 50 %计提当期返奖奖金。设置奖池，奖池由当期计提奖金与实际中出奖金的差额以及弃奖奖金组成。当期实际中</p>
              <p>出奖金未达当期计提奖金时，余额进入奖池；当期实际中出奖金超过当期计提奖金时，差额由奖池补充。当奖池总额不足时，由发行</p>
              <p>经费垫支。</p>
              <p>2、“欢乐生肖”游戏共设四个奖等，固定设奖，单注奖额分别为欢乐五奖100，000元、欢乐三奖1000元、欢乐二奖100元、欢乐一奖</p>
              <p>10元。</p>
              <p>3、“欢乐生肖”游戏组合，将欢乐一、欢乐二、欢乐三、欢乐五组合投注在一张彩票上，按实际中得奖等，合并计算奖金。奖金设置</p>
              <p>分别适用欢乐一、欢乐二、欢乐三、欢乐五中奖条件。</p>
              <p class="font-size-2p1 font-weight-bold">开奖</p>
              <p>1、每20分钟开奖一次开奖通过电子开奖系统进行。开奖结果由视频信号或公众媒体播出。</p>
              <p>2、销售截止，销售数据收集完毕，通过电子签名进行不可更改的电子加密后，方可正式开奖。</p>
              <p>3、中奖生肖由电子开奖系统产生。开奖时按绿区、红区、蓝区、黄区、紫区先后产生5个生肖组成中奖生肖。例如，如依次产生的5个</p>
              <p>生肖分别为：蛇、鼠、虎、龙、马。 那么“马龙虎鼠蛇”的数字排列序列称为中奖生肖。</p>
              <p>4、重庆市福利彩票发行中心根据中奖生肖进行检索、派彩，产生当期各奖等中奖注数及总奖额。</p>
              <p>5、各期开奖后，立即通过网络向投注终端发布中奖生肖和开奖结果。</p>
              <p>6、最后一期开奖是23：50，20分钟后（隔日第一期00：10）开放下注，故23：50-00：10中间会中断20分钟</p>
              <p class="font-size-2p1 font-weight-bold">中奖</p>
              <p>按投注生肖与中奖生肖按位相符情况确定中奖奖级，中奖生肖从个位对起：</p>
              <p>按“欢乐”级进行对奖，即欢乐五限对特等奖，欢乐三限对一等奖，欢乐二限对二等奖，欢乐一限对三等奖，互不混对。凡符合下列</p>
              <p>情况的，即获得相应中奖资格：</p>
              <p>欢乐五：单注投注生肖的5个生肖与当期中奖生肖的5位生肖按位全部相符，即中奖；</p>
              <p class="ml-2">欢乐三：单注投注生肖与当期中奖生肖的连续后3位生肖按位相符（蓝区+红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐二：单注投注生肖与当期中奖生肖的连续后2位生肖按位相符（红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐一：单注投注生肖与当期中奖生肖的绿区生肖按位相符，即中奖；</p>
            </div>
            <div v-if="iNumber === 3">新疆时时彩</div>
            <div v-if="iNumber === 4">天津时时彩</div>
            <div v-if="iNumber === 5">广东快乐十分</div>
            <div v-if="iNumber === 6">广东11选5</div>
            <div v-if="iNumber === 7">江苏快3</div>
            <div v-if="iNumber === 8">十一运夺金</div>
            <div v-if="iNumber === 9">重庆辛运农场</div>
            <div v-if="iNumber === 10">快3</div>
            <div v-if="iNumber === 11">11选5</div>
            <div v-if="iNumber === 12">北京快乐8</div>
            <div v-if="iNumber === 13">PC蛋蛋</div>
            <div v-if="iNumber === 14">福彩3D</div>
            <div v-if="iNumber === 15">台湾宾果</div>
          </div>
        </div>
      </Col>
    </Row>
    <Footer />
  </div>
</template>
<style scoped lang="scss">
@import 'Index-scoped.scss';

</style>

<script lang="ts">
import {
  Component,
  Watch,
  Vue,
} from 'vue-property-decorator';

import {
  warn,
} from 'vue-class-component/lib/util';

import {
  Header,
  NavTop,
  NavRight,
  Footer,
} from '@/Commons/';

import {
  LOTTERIES,
  BACKEND,
} from '@/CONFIGS/';


@Component({
  name: 'Rule',
  components: {
    Header,
    NavTop,
    NavRight,
    Footer,
  },
})
class Rule extends Vue {
  public iNumber = 1;

  public toggleLottery( iNumber: number ) {
    this.iNumber = iNumber;
  }

}

export default Rule;
</script>
