<template>
  <div class="page rule">
    <Header />
    <NavTop/>
    <NavRight />
    <Row :gutter="30" class="backgrond-mian">
      <Col 
        :xs="{span: 6, offset: 1}" 
        :sm="{span: 6, offset: 2}" 
        :md="{span: 5, offset: 2}" 
        :lg="{span: 6, offset: 2}"
        :xl="{span: 4, offset: 4}">
        <div class="rule-head">首页&nbsp;&gt;
          <span v-if="code === 'BJPK10'">北京PK10</span>
          <span v-if="code === 'CQSSC'">重庆时时彩</span>
          <span v-if="code === 'XJSSC'">新疆时时彩</span>
          <span v-if="code === 'PL3'">体彩排列3</span>
          <span v-if="code === 'GDKLSF'">广东快乐十分</span>
          <span v-if="code === 'GD11X5'">广东11选5</span>
          <span v-if="code === 'JSK3'">江苏快3</span>
          <span v-if="code === 'SD11X5'">十一运夺金</span>
          <span v-if="code === 'CQXYNC'">重庆辛运农场</span>
          <span v-if="code === 'K3'">快3</span>
          <span v-if="code === '11X5'">11选5</span>
          <span v-if="code === 'BJKL8'">北京快乐8</span>
          <span v-if="code === 'PCDD'">PC蛋蛋</span>
          <span v-if="code === 'FC3D'">福彩3D</span>
          <span v-if="code === 'TWBG'">台湾宾果</span>
        </div>
        <div class="rule-content">
          <div class="lottery-menu">
            <ul class="font-weight-bold font-size-1p5">
              <li class="font-size-2">玩法规则</li>
              <li :class=" code === 'BJPK10' ? 'background-li':'' " @click="toggleLottery('BJPK10')">北京PK10</li>
              <li :class=" code === 'CQSSC' ? 'background-li':'' " @click="toggleLottery('CQSSC')">重庆时时彩</li>
              <li :class=" code === 'XJSSC' ? 'background-li':'' " @click="toggleLottery('XJSSC')">新疆时时彩</li>
              <li :class=" code === 'PL3' ? 'background-li':'' " @click="toggleLottery('PL3')">体彩排列3</li>
              <li :class=" code === 'GDKLSF' ? 'background-li':'' " @click="toggleLottery('GDKLSF')">广东快乐十分</li>
              <li :class=" code === 'GD11X5' ? 'background-li':'' " @click="toggleLottery('GD11X5')">广东11选5</li>
              <li :class=" code === 'JSK3' ? 'background-li':'' " @click="toggleLottery('JSK3')">江苏快3</li>
              <li :class=" code === 'SD11X5' ? 'background-il':'' " @click="toggleLottery('SD11X5')">十一运夺金</li>
              <li :class=" code === 'CQXYNC' ? 'background-li':'' " @click="toggleLottery('CQXYNC')">重庆辛运农场</li>
              <li :class=" code === 'K3' ? 'background-li':'' " @click="toggleLottery('K3')">快3</li>
              <li :class=" code === '11X5' ? 'background-li':'' " @click="toggleLottery('11X5')">11选5</li>
              <li :class=" code === 'BJKL8' ? 'background-li':'' " @click="toggleLottery('BJKL8')">北京快乐8</li>
              <li :class=" code === 'PCDD' ? 'background-li':'' " @click="toggleLottery('PCDD')">PC蛋蛋</li>
              <li :class=" code === 'FC3D' ? 'background-li':'' " @click="toggleLottery('FC3D')">福彩3D</li>
              <li :class=" code === 'TWBG' ? 'background-li':'' " @click="toggleLottery('TWBG')">台湾宾果</li>
            </ul>
          </div>
        </div>
      </Col>
      <Col 
         :xs="{span: 15}" :sm="{span: 14}" :md="{span: 15}" :lg="{span: 14}" :xl="{span: 12}">
        <div class="rule-content ">
          <div class="rule-details mb-2 background-white">
            <div class="rule-pk10" v-if="code === 'BJPK10'">
              <p class="text-center font-size-2p5 font-weight-bold">“PK10”游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条　根据《彩票管理条例》、《彩票管理条例实施细则》、《彩票发行销售管理办法》（财综[2012]102号）等有关规定，制定本规则。
              <p>第二条　中国福利彩票PK10游戏(以下简称PK10）由中国福利彩票发行管理中心发行和组织销售，由北京市福利彩票销售机构（以下称北京福彩机构）在所</p>  
              <p>辖区域内销售。</p>
              <p>第三条　PK10采用计算机网络系统发行，在北京福彩机构设置的销售网点销售，定期开奖。</p>
              <p>第四条　PK10实行自愿购买，凡购买者均被视为同意并遵守本规则。</p>
              <p>第五条　不得向未成年人销售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条　PK10采用排列式玩法。从左至右共有十个投注位置，排列顺序分别为一至十号位置，每个位置可从1-10的自然数中选择一个号码。投注者先选择。</p>
              <p>投注位置个数，投注位置个数最少一个、最多十个；然后按照从左至右的顺序，必须从一号位置开始，在每个位置上从1-10的自然数中选择一个号码进行投</p>
              <p>注；若投注位置个数超过两个的，后选位置的投注号码不能与前面所有已选位置的投注号码相同。投注者所选号码按位置顺序排序组成一组号码，该组号码</p>
              <p>即为一注PK10投注号码。每注金额人民币2元。购买者可对其选定的投注号码进行多倍投注，投注倍数为2、3、4、5、10。单张彩票的投注金额不得超过</p>
              <p>20000元。</p>
              <p>第七条　购买者可在北京福彩机构设置的销售网点投注。投注号码经投注机打印出兑奖凭证，交购买者保存，此兑奖凭证即为PK10彩票。</p>
              <p>第八条　PK10设置“普通”、“精确”、“精确组选”、“位置”、“拖拉机”、“猜奇偶”、“猜大小”以及“和数”投注方式，具体规定如下：</p>
              <p>（一）普通投注：从一号位置开始，选择最少一个、最多十个位置，每个位置上从1-10的自然数中选择一个号码，投注位置个数超过两个的，后选位置的投</p>
              <p>注号码不能与前面所有已选位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（二）精确投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有已选</p>
              <p>位置的投注号码相同，将选定的号码按照位置顺序连续组成一组号码进行投注。</p>
              <p>（三）精确组选投注：从一号位置开始，选择两个或三个或四个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面所有</p>
              <p>已选位置的投注号码相同，将选定位置上的号码的所有排列方式作为一注投注号码进行投注。</p>
              <p>（四）位置投注：从一至三号位置中，选择一个或二个位置，每个位置上从1-10的自然数中选择一个号码，且后选位置的投注号码不能与前面已选位置的投</p>
              <p>注号码相同，将选定的一个或二个号码作为一注投注号码进行投注。</p>
              <p>（五）拖拉机投注：以一至三号位置上的开奖号码是否是一个连续的三位数字（升序或降序）作为投注结果进行投注。</p>
              <p>（六）猜奇偶投注：以一至三号位置上的开奖号码是否全部是奇数或偶数作为投注结果进行投注。“猜奇偶”投注又分为“全偶”和“全奇”两种投注。</p>
              <p>（七）猜大小投注：以一至三号位置上的开奖号码的三个数字之和的数值大小作为投注结果进行投注。“猜大小”投注又分为“猜大”和“猜小”两种投</p>
              <p>注。</p>
              <p>（八）和数投注：以一至三号位置上的开奖号码的三个数字之和的数值作为投注结果进行投注。</p>
              <p>第九条 购买者可选择机选号码投注、自选号码投注。机选号码投注是指由投注机随机产生投注号码进行投注，自选号码投注是指将购买者选定的号码输入投</p>
              <p>注机进行投注。</p>
              <p>第十条 购买者可选择多期投注。多期投注是指购买从当期起连续不超过12期的彩票。</p>
              <p>第十一条 PK10每期销售时间为20分钟。销售期号按每期开奖顺序编排。</p>
              <p>第十二条 PK10每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。若因销售终端故障、通讯线路故障和销售网点信用额度受限</p>
              <p>等原因造成投注不成功，应退还购买者投注金额。</p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十三条 PK10按当期销售额的50%、15%和35%分别计提彩票奖金、彩票发行费和彩票公益金。彩票奖金分为当期奖金和调节基金，其中，49%为当期奖</p>
              <p>金，1%为调节基金。</p>
              <p>第十四条 PK10按照不同投注方式分别设奖。具体设奖如下：</p>
              <p>（一）普通投注</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>匹配个数</td>
                    <td>选10</td>
                    <td>选9</td>
                    <td>选8</td>
                    <td>选7</td>
                    <td>选6</td>
                    <td>选5</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                    <td>选1</td>
                  </tr>
                  <tr>
                    <td>10</td>
                    <td>888888</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>9</td>
                    <td>-</td>
                    <td>80000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>8</td>
                    <td>-</td>
                    <td>10000</td>
                    <td>40000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>7</td>
                    <td>-</td>
                    <td>5000</td>
                    <td>2000</td>
                    <td>20000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>6</td>
                    <td>-</td>
                    <td>250</td>
                    <td>500</td>
                    <td>4500</td>
                    <td>10000</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>5</td>
                    <td>-</td>
                    <td>50</td>
                    <td>100</td>
                    <td>400</td>
                    <td>2000</td>
                    <td>500</td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>4</td>
                    <td>-</td>
                    <td>10</td>
                    <td>20</td>
                    <td>25</td>
                    <td>100</td>
                    <td>30</td>
                    <td>350</td>
                    <td></td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>3</td>
                    <td>-</td>
                    <td>5</td>
                    <td>10</td>
                    <td>10</td>
                    <td>10</td>
                    <td>8</td>
                    <td>20</td>
                    <td>160</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td>1</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>2</td>
                    <td>10</td>
                  </tr>
                  <tr>
                    <td>0</td>
                    <td>2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                    <td>-</td>
                  </tr>
                </tbody>
              </table>
              <p>（二）精确投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">匹配个数</td>
                    <td>选4</td>
                    <td>选3</td>
                    <td>选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">4</td>
                    <td>5000</td>
                    <td></td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">3</td>
                    <td>-</td>
                    <td>700</td>
                    <td></td>
                  </tr>
                  <tr>
                    <td colspan="2">2</td>
                    <td>-</td>
                    <td>-</td>
                    <td>90</td>
                  </tr>
                </tbody>
              </table>
              <p>（三）精确组选投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="2">投注方式</td>
                    <td>组选4</td>
                    <td>组选3</td>
                    <td>组选2</td>
                  </tr>
                  <tr>
                    <td colspan="2">中奖金额(元/注)</td>
                    <td>205</td>
                    <td>118</td>
                    <td>44</td>
                  </tr>
                </tbody>
              </table>
              <p>（四）位置、拖拉机、猜奇偶、猜大小、和数投注</p>
              <table class="w-75 text-center">
                <tbody>
                  <tr>
                    <td colspan="3">投注方式</td>
                    <td colspan="2">中奖金额</td>
                  </tr>
                  <tr>
                    <td  colspan="2" rowspan="2"><span class="position-relative">位置投注</span></td>
                    <td>位置1</td>
                    <td colspan="2">3</td>
                  </tr>
                  <tr>
                    <td>位置2</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td colspan="3">拖拉机投注</td>
                    <td colspan="2">44</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜奇偶投注</span></td>
                    <td>全偶</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td>全寄</td>
                    <td colspan="2">12</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="2"><span class="position-relative">猜大小投注</span></td>
                    <td>猜大</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td>猜小</td>
                    <td colspan="2">5</td>
                  </tr>
                  <tr>
                    <td colspan="2" rowspan="22"><span class="sum-bet position-relative">和数投注</span></td>
                    <td>和数6</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数7</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数8</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数9</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数10</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数11</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数12</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数13</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数14</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数15</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数16</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数17</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数18</td>
                    <td colspan="2">11</td>
                  </tr>
                  <tr>
                    <td>和数19</td>
                    <td>13</td>
                  </tr>
                  <tr>
                    <td>和数20</td>
                    <td colspan="2">15</td>
                  </tr>
                  <tr>
                    <td>和数21</td>
                    <td colspan="2">17</td>
                  </tr>
                  <tr>
                    <td>和数22</td>
                    <td colspan="2">23</td>
                  </tr>
                  <tr>
                    <td>和数23</td>
                    <td colspan="2">29</td>
                  </tr>
                  <tr>
                    <td>和数24</td>
                    <td colspan="2">39</td>
                  </tr>
                  <tr>
                    <td>和数25</td>
                    <td colspan="2">59</td>
                  </tr>
                  <tr>
                    <td>和数26</td>
                    <td colspan="2">118</td>
                  </tr>
                  <tr>
                    <td>和数27</td>
                    <td colspan="2">118</td>
                  </tr>
                </tbody>
              </table>
              <p>第十五条 PK10设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别奖。</p>
              <p>动用调节基金设立特别奖，应报同级财政部门审核批准</p>
              <p>第十六条 PK10设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于当期计提奖金时，余额进入奖池；当期实际中出奖</p>
              <p>金超过当期计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票兑奖周转金垫支。在出现彩票兑奖周转</p>
              <p>金垫支的情况下，当调节基金有资金滚入时优先偿还垫支的彩票兑奖周转金。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第十七条 PK10采用专用电子开奖设备开奖。每期开奖时按照从左至右的顺序进行，第一个开出的号码对应一号位置，第二个开出的号码对应二号位置，依</p>
              <p>次类推，直到开出对应十号位置的号码为止，这十个位置对应的号码排列组成当期开奖号码。每期开奖时间为20分钟。</p>
              <p>第十八条 每期开奖后，北京福彩机构应向社会公布开奖号码、当期销售总额、各奖级中奖情况及奖池资金余额等信息，并将开奖结果通知销售网点。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第十九条 根据购买者选择的PK10的投注号码和投注方式与当期开奖号码按数位顺序的相符情况，确定相应的中奖资格。具体规定如下：</p>
              <p>（一）普通投注</p>
              <p>投注一个位置：投注号码与对应位置的开奖号码完全相同，即选一中一，中奖10元。</p>
              <p>投注两个位置：投注号码与对应位置的两个开奖号码完全相同，即选二中二，中奖55元；其中任意一个相同，即选二中一，中奖2元。</p>
              <p>投注三个位置：投注号码与对应位置的三个开奖号码完全相同，即选三中三，中奖160元；其中任意两个相同，即选三中二，中奖10元；其中任意一个相</p>
              <p>同，即选三中一，中奖2元。</p>
              <p>投注四个位置：投注号码与对应位置的四个开奖号码完全相同，即选四中四，中奖350元；其中任意三个相同，即选四中三，中奖20元；其中任意两个相</p>
              <p>同，即选四中二，中奖5元；其中任意一个相同，即选四中一，中奖2元。</p>
              <p>投注五个位置：投注号码与对应位置的五个开奖号码完全相同，即选五中五，中奖500元；其中任意四个相同，即选五中四，中奖30元；其中任意三个相</p>
              <p>同，即选五中三，中奖8元；其中任意两个相同，即选五中二，中奖3元；其中任意一个相同，即选五中一，中奖2元。</p>
              <p>投注六个位置：投注号码与对应位置的六个开奖号码完全相同，即选六中六，中奖10000元；其中任意五个相同，即选六中五，中奖2000元；其中任意四个</p>
              <p>相同，即选六中四，中奖100元；其中任意三个相同，即选六中三，中奖10元；其中任意两个相同，即选六中二，中奖2元。</p>
              <p>投注七个位置：投注号码与对应位置的七个开奖号码完全相同，即选七中七，中奖20000元；其中任意六个相同，即选七中六，中奖4500元；其中任意五个</p>
              <p>相同，即选七中五，中奖400元；其中任意四个相同，即选七中四，中奖25元；其中任意三个相同，即选七中三，中奖10元；其中任意两个相同，即选七中</p>
              <p>二，中奖2元。</p>
              <p>投注八个位置：投注号码与对应位置的八个开奖号码完全相同，即选八中八，中奖40000元；其中任意七个相同，即选八中七，中奖2000元；其中任意六个</p>
              <p>相同，即选八中六，中奖500元；其中任意五个相同，即选八中五，中奖100元；其中任意四个相同，即选八中四，中奖20元；其中任意三个相同，即选八</p>
              <p>中三，中奖10元；其中任意两个相同，即选八中二，中奖2元。</p>
              <p>投注九个位置：投注号码与对应位置的九个开奖号码完全相同，即选九中九，中奖80000元；其中任意八个相同，即选九中八，中奖10000元；其中任意七</p>
              <p>个相同，即选九中七，中奖5000元；其中任意六个相同，即选九中六，中奖250元；其中任意五个相同，即选九中五，中奖50元；其中任意四个相同，即选</p>
              <p>九中四，中奖10元；其中任意三个相同，即选九中三，中奖5元；其中任意两个相同，即选九中二，中奖2元。</p>
              <p>投注十个位置：投注号码与对应位置的十个开奖号码完全相同，即选十中十，中奖888888元；投注号码与对应位置的十个开奖号码全部不同，中奖2元。</p>
              <p>（二）精确投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码完全相同，即选二中二，中奖90元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码完全相同，即选三中三，中奖700元</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码完全相同，即选四中四，中奖5000元。</p>
              <p>（三）精确组选投注</p>
              <p>投注两个位置：投注号码与一至二号位置的两个开奖号码不按先后顺序一一对应，即中精确组选2奖，中奖44元。</p>
              <p>投注三个位置：投注号码与一至三号位置的三个开奖号码不按先后顺序一一对应，即中精确组选3奖，中奖118元。</p>
              <p>投注四个位置：投注号码与一至四号位置的四个开奖号码不按先后顺序一一对应，即中精确组选4奖，中奖205元。</p>
              <p>（四）位置投注</p>
              <p>位置1：投注号码与一至三号位置中任意一个位置上的开奖号码相同，即中奖3元；</p>
              <p>位置2：投注号码与一至三号位置中任意两个位置上的开奖号码不按先后顺序一一对应，即中奖15元。</p>
              <p>（五）拖拉机投注</p>
              <p>一至三号位置上的三个开奖号码按照升序或降序排列成连续的三位数字（“9-10-1”和“1-10-9”、“10-1-2”和“2-1-10”除外），即中奖44元。</p>
              <p>（六）猜奇偶投注</p>
              <p>全偶：一至三号位置上的三个开奖号码全部为偶数，即中奖12元。</p>
              <p>全奇：一至三号位置上的三个开奖号码全部为奇数，即中奖12元。</p>
              <p>（七）猜大小投注</p>
              <p>猜大：一至三号位置上开奖号码的三个数字之和介于21（含）和27（含）之间，即中奖5元；</p>
              <p>猜小：一至三号位置上开奖号码的三个数字之和介于6（含）和12（含）之间，即中奖5元。</p>
              <p>（八）和数投注</p>
              <p>投注号码与一至三号位置上开奖号码的三个数字之和相同，即中奖。</p>
              <p>第二十条 当期每注投注号码只有一次中奖机会，按其投注方式中得匹配号码最多的奖等，不能兼中兼得，特别设奖除外。</p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十一条 PK10兑奖期当期有效。中奖者应当自开奖之日起60个自然日内，持中奖彩票到指定的地点兑奖。逾期未兑奖视为弃奖，弃奖奖金纳入彩票公益</p>
              <p>金。</p>
              <p>第二十二条 中奖彩票是兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</p>
              <p>第二十三条 兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p class="font-size-1p5 font-weight-bold">附则</p>
              <p>第二十四条 本规则自批准之日起执行。</p>
            </div>
            <div class="rule-cqssc" v-if="code === 'CQSSC'">
              <p class="text-center font-size-2p5 font-weight-bold">重庆欢乐生肖玩法规则</p>
              <p>1.“生肖”动物十选一，选中即中奖，每20分钟开奖一次。</p>
              <p>2.“欢乐生肖”游戏共设5种颜色开奖区域，10种生肖</p>
              <p class="ml-2">5种颜色分别为：紫区、黄区、蓝区、红区、绿区</p>
              <p class="ml-2">10种生肖分别为：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪</p>
              <p>「欢乐生肖」与「时时彩」对比：</p>
              <p class="ml-2">「欢乐生肖」生肖：鼠、虎、兔、龙、蛇、马、羊、猴、鸡、猪分别对应</p>
              <p class="ml-2">「时时彩 」数字： 0、 1、 2、 3、 4、 5、 6、 7、 8、 9</p>
              <p class="ml-2">「欢乐生肖」颜色：  紫、黄、蓝、红、绿分别对应</p>
              <p class="ml-2">「时时彩」开奖区域：万、千、百、十、个位开奖区域</p>
              <p>4.①欢乐生肖有欢乐一、欢乐二、欢乐三、欢乐五 四种玩法</p>
              <p class="ml-2">欢乐一：投注绿色区域，单注投注金额2元，单注奖金10元。</p>
              <p class="ml-2">欢乐二：投注红色和绿色区域，单注投注金额2元，单注奖金100元。</p>
              <p class="ml-2">欢乐三：投注蓝色、红色和绿色区域，单注投注金额2元，单注奖金1000元。</p>
              <p class="ml-2">欢乐五：投注紫色、黄色、蓝色、红色和绿色区域，单注投注金额2元，单注奖金     100000元</p>
              <p>②欢乐生肖有欢乐组合二、欢乐组合三、欢乐组合五 三种组合玩法</p>
              <p class="ml-2">欢乐二组合：投注红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中红色、绿色区域，获得奖</p>
              <p>金100元。</p>
              <p class="ml-2">欢乐三组合：投注蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中蓝色、红色、绿色</p>
              <p>区域，获得奖金1000元。</p>
              <p class="ml-2">欢乐五组合：投注紫色、黄色、蓝色、红色、绿色区域，投注时至少有一个颜色区域选择的“生肖”个数多于一个，命中紫</p>
              <p>色、黄色、蓝色、红色、绿色区域，获得奖金100000元。</p>
              <p class="font-size-2p1font-weight-bold">投注</p>
              <p>1、投注者可在全市所有经市福利彩票发行中心批准、并展示《中国福利彩票“时时彩”销售许可证》的投注站投注。</p>
              <p>2、投注者可选择电话投注或投注卡、银行卡投注，并遵守相应规范。</p>
              <p>3、按不同游戏，投注方法可分自选和机选生肖投注；单倍和多倍投注。</p>
              <p>4、通过投注单投注时，按照投注单上的要求及所示方法正确填涂。
              <p>5、投注生肖经投注机确认，打印在“时时彩”电脑福利彩票上，作为对奖凭证，交投注者</p>
              <p>6、每注投注金额为人民币2元，每张彩票可打印1—5注投注生肖，投注者可选择多倍投注。</p>
              <p>7、投注前彩民应对投注进行确认，彩票售出后不得退换。</p>
              <p>8、如因投注机或通讯故障，投注站销售金额受限等原因造成投注不成功，投注站应立即退还相应收取的投注金额，彩民可选择到其它</p>
              <p>投注站投注或电话投注的方式。如使用卡投注，系统将在一个工作日内返回相应投注款。</p>
              <p>9、每期的每个投注生肖的投注注数，根据市场销售情况限量发行。如投注生肖受限，投注不能成功，属时时彩游戏规则规定的正常运</p>
              <p>行情况，投注者只能在该生肖恢复销售后继续投注。</p>
              <p>11、未成年人不得参与投注。</p>
              <p class="font-size-2p1 font-weight-bold">设奖</p>
              <p>1、每期销售总额的 50 %计提当期返奖奖金。设置奖池，奖池由当期计提奖金与实际中出奖金的差额以及弃奖奖金组成。当期实际中</p>
              <p>出奖金未达当期计提奖金时，余额进入奖池；当期实际中出奖金超过当期计提奖金时，差额由奖池补充。当奖池总额不足时，由发行</p>
              <p>经费垫支。</p>
              <p>2、“欢乐生肖”游戏共设四个奖等，固定设奖，单注奖额分别为欢乐五奖100，000元、欢乐三奖1000元、欢乐二奖100元、欢乐一奖</p>
              <p>10元。</p>
              <p>3、“欢乐生肖”游戏组合，将欢乐一、欢乐二、欢乐三、欢乐五组合投注在一张彩票上，按实际中得奖等，合并计算奖金。奖金设置</p>
              <p>分别适用欢乐一、欢乐二、欢乐三、欢乐五中奖条件。</p>
              <p class="font-size-2p1 font-weight-bold">开奖</p>
              <p>1、每20分钟开奖一次开奖通过电子开奖系统进行。开奖结果由视频信号或公众媒体播出。</p>
              <p>2、销售截止，销售数据收集完毕，通过电子签名进行不可更改的电子加密后，方可正式开奖。</p>
              <p>3、中奖生肖由电子开奖系统产生。开奖时按绿区、红区、蓝区、黄区、紫区先后产生5个生肖组成中奖生肖。例如，如依次产生的5个</p>
              <p>生肖分别为：蛇、鼠、虎、龙、马。 那么“马龙虎鼠蛇”的数字排列序列称为中奖生肖。</p>
              <p>4、重庆市福利彩票发行中心根据中奖生肖进行检索、派彩，产生当期各奖等中奖注数及总奖额。</p>
              <p>5、各期开奖后，立即通过网络向投注终端发布中奖生肖和开奖结果。</p>
              <p>6、最后一期开奖是23：50，20分钟后（隔日第一期00：10）开放下注，故23：50-00：10中间会中断20分钟</p>
              <p class="font-size-2p1 font-weight-bold">中奖</p>
              <p>按投注生肖与中奖生肖按位相符情况确定中奖奖级，中奖生肖从个位对起：</p>
              <p>按“欢乐”级进行对奖，即欢乐五限对特等奖，欢乐三限对一等奖，欢乐二限对二等奖，欢乐一限对三等奖，互不混对。凡符合下列</p>
              <p>情况的，即获得相应中奖资格：</p>
              <p>欢乐五：单注投注生肖的5个生肖与当期中奖生肖的5位生肖按位全部相符，即中奖；</p>
              <p class="ml-2">欢乐三：单注投注生肖与当期中奖生肖的连续后3位生肖按位相符（蓝区+红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐二：单注投注生肖与当期中奖生肖的连续后2位生肖按位相符（红区+绿区），即中奖；</p>
              <p class="ml-2">欢乐一：单注投注生肖与当期中奖生肖的绿区生肖按位相符，即中奖；</p>
            </div>
            <div class="rule-xjssc" v-if="code === 'XJSSC'">
              <p class="text-center font-size-2p5 font-weight-bold">新疆时时彩游戏规则</p>
              <p class="font-size-1p5 font-weight-bold">总则</p>
              <p>第一条 根据《彩票管理条例》等有关规定，制定本规则。 </p>
              <p>第二条 中国福利彩票新疆维吾尔自治区时时彩（以下简称“时时彩”）由中国福利彩票发行管理中心组织发行，新疆维吾尔自治区福利彩票销售机构（以下</p>
              <p>称“新疆福彩机构”）在所辖区域内组织销售。 </p>
              <p>第三条 时时彩采用计算机系统发行销售，定期开奖。 </p>
              <p>第四条 时时彩实行自愿购买，凡购买该彩票均被视为同意并遵守本规则。 </p>
              <p>第五条 不得向未成年人出售彩票或兑付奖金。</p>
              <p class="font-size-1p5 font-weight-bold">投注</p>
              <p>第六条 时时彩是从00000到99999中任意选择一个1位至5位自然数组成一注彩票进行单式投注。五个位置从左至右分别</p>
              <p>为“万位”、“千位”、“百位”、“十位”、“个位”，共设置直选、组选、任选、五星通选、大小单双、趣味二星、区</p>
              <p>间二星等投注方式。每注金额人民币2元。 </p>
              <p>第七条 直选投注包括一星、二星、三星、四星、五星 </p>
              <p>直选投注： </p>
              <p>（一）直选一星：是指投注者从0-9的数字号码中任意选择一个，对个位、十位、百位、千位、万位其中任何一位进行投</p>
              <p>注。 </p>
              <p>（二）直选二星：是指分别从“十位”、“个位”任选一个号码组合为一个两位数排列的直选投注。 </p>
              <p>（三）直选三星：是指分别从“百位”、“十位”、“个位”任选一个号码组合为一个三位数排列的直选投注。 </p>
              <p>（四）直选四星：是指分别从“千位”、“百位”、“十位”、“个位”任选一个号码组合为一个四位数排列的直选投注。</p>
              <p>（五）直选五星：是指分别从“万位”、“ 千位”、“百位”、“十位”、“个位”任选一个号码组合为一个五位数排列的</p>
              <p>直选投注。 </p>
              <p>第八条 直选投注的投注方式分为单选投注和复选投注。单选投注是将一组投注号码以唯一的排列方式进行单注投注。复选投</p>
              <p>注是指将各星级组合在一起作为一组投注号码的多注投注。复选投注范围从二星奖到五星奖，当所选号码在某一星级中奖</p>
              <p>时，也同时中得该星级以下的相应奖级。 </p>
              <p>第九条 组选投注包括二星、三星组选： </p>
              <p>（一）二星组选：是指从0-9十个数字中任选两个不同的数字对“十位”和“个位”进行组选投注。 </p>
              <p>（二）三星组选：是指投注者可在0-9十个自然数中任意选择三个数字对“百位”、“十位”、“个位”进行组选投注，包</p>
              <p>括“三星组选六”和“三星组选三”。 </p>
              <p>1、三星组选六：如果一注号码的三个数字各不相同，则有六种排列方式，称为“三星组选六”。</p>
              <p>2、三星组选三：如果一注号码的三个数字中有两个数字相同，则有三种排列方式，称为“三星组选三”。 </p>
              <p>第十条 任选投注包括二星、三星任选：</p>
              <p>（一）二星任选：是指投注者在“万位”、“千位”、“百位”、“十位”、“个位”的任意两位中，每位从0-9十个数字号</p>
              <p>码中任选一个号码组合为一个两位数字排列的直选投注。 </p>
              <p>（二）三星任选：是指投注者在“万位”、“千位”、“百位”、“十位”、“个位”的任意三位中，每位从0-9十个数字号</p>
              <p>码中任选一个号码组合为一个三位数字排列的直选投注。 </p>
              <p>第十一条 五星通选投注是指从00000-99999中选择一个五位数排列进行通选投注。 </p>
              <p>第十二条 大小单双投注是指投注者对“十位”和“个位”位置的数字进行“大小、单双”的指定投注，0-4为小号，5-9为大</p>
              <p>0、2、4、6、8为双号。 </p>
              <p>第十三条 趣味二星投注是指个位和十位分别从0-9的数字号码中选择一个数字，百位从“大小号”中任选一种进行的排列投注。其中，0-4为“小号”；5-9</p>
              <p>为“大号”。 </p>
              <p>第十四条 区间二星投注是指个位和十位分别从0-9的数字号码中任选一个数字，百位从5个区间中任选一区间进行唯一排列方式的投注（下列区间简</p>
              <p>称“区”）。其中，百位上数字“0”和“1”为一区，“2” 和“3”为二区，“4” 和“5”为三区，“6” 和“7”为四区，“8”和“9”为五区。 </p>
              <p>第十五条 时时彩每期销售时间为20分钟。销售期号按每期开奖顺序编排。 </p>
              <p>第十六条 购买者应在新疆福彩机构设置的投注站进行投注。投注号码可由投注机随机产生，也可通过投注单将购买者选定的号码输入投注机确定。投注号码</p>
              <p>经系统确认后打印出的对奖凭证即为时时彩彩票，交购买者保存。 </p>
              <p>第十七条 时时彩每期全部投注号码的可投注数量实行限量销售，若投注号码受限，则不能投注。 </p>
              <p>第十八条 若因销售终端故障、通讯线路故障和投注站授权额度受限等原因造成投注不成功，应退还投注者投注金额。 </p>
              <p class="font-size-1p5 font-weight-bold">设奖</p>
              <p>第十九条 时时彩按每期销售额的59%、13%、28%分别计提彩票奖金、彩票发行费和彩票公益金。彩票奖金分为当期奖金和调节基金，58%为当期奖金，</p>
              <p>1%为调节基金。 </p>
              <p>第二十条 时时彩按不同单式投注方式设奖，均为固定奖。奖金规定如下： </p>
              <p>（一）直选投注 </p>
              <p>1、五星直选：单注奖金固定为116000元； </p>
              <p>2、四星直选： </p>
              <p>（1）四星直选一等奖：单注奖金固定为9999元； </p>
              <p>（2）四星直选二等奖：单注奖金固定为75元； </p>
              <p>3、三星直选：单注奖金固定为1160元；</p>
              <p>4、二星直选： </p>
              <p>（1）二星直选一等奖：单注奖金固定为100元； </p>
              <p>（2）二星直选二等奖：单注奖金固定为16元； </p>
              <p>5、一星直选：单注奖金固定为11元。 </p>
              <p>（二）组选投注 </p>
              <p>1、二星组选：单注奖金固定为58元。 </p>
              <p>2、三星组选： </p>
              <p>（1）三星组选六：单注奖金固定为192元； </p>
              <p>（2）三星组选三：单注奖金固定为386元。 </p>
              <p>（三）任选投注 </p>
              <p>1、二星任选： </p>
              <p>（1）二星任选一等奖：单注奖金固定为80元； </p>
              <p>（2） 二星任选二等奖：单注奖金固定为9元。 </p>
              <p>2、三星任选： </p>
              <p>（1）三星任选一等奖：单注奖金固定为600元； </p>
              <p>（2）三星任选二等奖：单注奖金固定为20元。 </p>
              <p>（四）五星通选投注 </p>
              <p>1、五星通选一等奖：单注奖金固定为32000元； </p>
              <p>2、五星通选二等奖：单注奖金固定为220元； </p>
              <p>3、五星通选三等奖：单注奖金固定为20元。 </p>
              <p>（五）大小单双投注 </p>
              <p>大小单双：单注奖金固定为4.5元； </p>
              <p>（六）趣味二星投注 </p>
              <p>1、趣味二星一等奖：单注奖金固定为180元； </p>
              <p>2、趣味二星二等奖：单注奖金固定为20元； </p>
              <p>3、趣味二星三等奖：单注奖金固定为12元。 </p>
              <p>（七）区间二星投注 </p>
              <p>（1）区间二星一等奖：单注奖金固定为500元； </p>
              <p>（2）区间二星二等奖：单注奖金固定为20元。 </p>
              <p>第二十一条 时时彩设置调节基金。调节基金包括按销售总额1%提取部分、逾期未退票的票款。调节基金用于支付不可预见的奖金支出风险，以及设立特别</p>
              <p>奖。动用调节基金设立特别奖，应报同级财政部门审核批准。 </p>
              <p>第二十二条 时时彩设置奖池。奖池资金由当期计提奖金与实际中出奖金的差额组成。当期实际中出奖金小于计提奖金时，余额进入奖池；当期实际中出奖金</p>
              <p>超过计提奖金时，差额由奖池资金补足。当奖池资金总额不足时，由调节基金补足，调节基金不足时，用彩票机构业务费垫支。在出现业务费垫支的情况</p>
              <p>下，当调节基金有资金滚入时优先偿还垫支的业务费。</p>
              <p class="font-size-1p5 font-weight-bold">开奖</p>
              <p>第二十三条 时时彩采用专用电子开奖设备开奖，每期开出一组5位自然数作为当期开奖号码。开奖号码的顺序不能颠倒，每期开奖时间为20分钟。 </p>
              <p>第二十四条 每期开奖统计数据以新疆福彩机构数据中心收到的销售有效数据为准。每天将当日所有数据刻入不可改写的光盘，并将当日所有数据提交公证处</p>
              <p>备查。</p>
              <p class="font-size-1p5 font-weight-bold">中奖</p>
              <p>第二十六条 购买者所购彩票的投注号码与当期开奖号码对照，符合以下情况即为中奖。</p>
              <p>（一）直选投注 </p>
              <p>1、五星直选：投注号码由00000—99999组成，投注号码与当期开奖号码按位全部相符（万位+千位+百位+十位+个位），即中奖； </p>
              <p>2、四星直选： </p>
              <p>（1）四星直选一等奖：投注号码由0000—9999组成，投注号码与当期开奖号码的连续后四位号码按位相符（千位+百位+十位+个位），即中奖； </p>
              <p>（2）四星直选二等奖：投注号码由0000—9999组成，投注号码的首或尾三位连续号码与当期开奖号码的首或尾连续三位号码按位相符，即中奖； </p>
              <p>3、三星直选：投注号码由000—999组成，投注号码与当期开奖号码的连续后三位号码按位相符（百位+十位+个位），即中奖； </p>
              <p>4、二星直选： </p>
              <p>（1）二星直选一等奖：投注号码由00—99组成，投注号码与当期开奖号码的连续后两位号码按位相符（十位+个位），即中奖</p>
              <p>（2）二星直选二等奖：投注号码由00—99组成，投注号码与当期开奖号码的连续后两位号码不按位相符（十位+个位），即中奖。 </p>
              <p>5、一星直选：投注号码由0—9和个位、十位、百位、千位、万位其中的任何一位组成，投注号码与当期开奖号码对应位置的号码相符，即中奖；</p>
              <p>（二）组选投注 </p>
              <p>1、二星组选：投注号码与当期开奖号码的连续后两位号码相同（顺序不限），即中奖。 </p>
              <p>2、三星组选：投注号码与当期开奖号码的连续后三位号码相同（顺序不限），即中奖。 </p>
              <p>（三）任选投注 </p>
              <p>1、二星任选： </p>
              <p>（1）二星任选一等奖：投注号码与当期开奖号码所对应位置的两位号码按位相符，即中奖。 </p>
              <p>（2）二星任选二等奖：投注号码与当期开奖号码对应位置的两位号码的首位加1或减1相符且末位按位相符，或末位加1或减1相符且首位按位相符，即中奖</p>
              <p>（0减1为9）。 </p>
              <p>2、三星任选： </p>
              <p>（1）三星任选一等奖：投注号码与当期开奖号码所对应位置的三位号码按位相符，即中奖。 </p>
              <p>（2）三星任选二等奖：投注号码中任意两位与当期开奖号码所对应位置的两位号码按位相符，即中奖。 </p>
              <p>（四）五星通选投注 </p>
              <p>1、五星通选一等奖：投注五位数号码与当期开奖号码相同且排列一致，即中奖； </p>
              <p>2、五星通选二等奖：投注五位数号码中首或尾连续三位数号码与当期开奖号码首或尾连续三位数数字相同且排列一致，即中奖； </p>
              <p>3、五星通选三等奖：投注五位数号码中首或尾连续两位数号码与当期开奖号码首或尾连续两位数数字相同且排列一致，即中奖。 </p>
              <p>（五）大小单双投注 </p>
              <p>大小单双：投注号码“十位、个位”数字的“大小、单双”与当期开奖号码“十位、个位”数字的“大小、单双”位置、性质相同，即中奖。 </p>
              <p>（六）趣味二星投注 </p>
              <p>1、趣味二星一等奖：投注号码个位、十位与开奖号码按位相符，且投注号码百位的“大小号”与开奖号码的“大小号”相符，即中奖，并同时中得趣味二</p>
              <p>星二等奖；</p>
              <p>2、趣味二星二等奖：投注号码个位、十位与开奖号码按位相符，但投注号码百位的“大小号”与开奖号码的“大小号”不相符，即中奖；</p>
              <p>3、趣味二星三等奖：投注号码个位、十位与开奖号码不按位相符，且投注号码百位的“大小号”与开奖号码的“大小号”相符，即中奖。 </p>
              <p>（七）区间二星投注 </p>
              <p>1、区间二星一等奖：投注号码个位、十位与开奖号码按位相符，且投注百位的区间与开奖号码百位区间相同，即中奖； </p>
              <p>2、区间二星二等奖：投注号码个位、十位与开奖号码按位相符，但投注百位的区间与开奖号码百位区间不相同，即中奖。</p>
              <p>第二十七条 除五星通选、四星直选、趣味二星投注和特别设奖外，当期每注投注号码只能按其选择的投注方式在相应的星级上有一次中奖机会，各种投注方</p>
              <p>式不能兼中兼得。 </p>
              <p class="font-size-1p5 font-weight-bold">兑奖</p>
              <p>第二十八条 时时彩中奖当期有效。每期自开奖之日起60个自然日为兑奖期，逾期未兑视为弃奖。弃奖奖金纳入彩票公益金。</p>
              <p>第二十九条 中奖彩票为兑奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。 </p>
              <p>第三十条 兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。 </p>
              <p>附则</p>
              <p>第三十一条 本规则自批准之日起执行。</p>
            </div>
            <div class="rule-pl3" v-if="code === 'PL3'">
              <p class="text-center font-size-2p5 font-weight-bold">体彩排列3玩法规则</p>
              <p class="font-size-1p5 font-weight-bold">排列三游戏规则</p>
              <p>“排列三”原为“7星彩”附加玩法，自2004年12月8日起从原有的七星彩玩法中分离出来，单独使用摇奖机、摇奖球进行摇奖，“排列三”、“排列5”共</p>
              <p>同摇奖，一次摇出5个号码，“排列三”的中奖号码为当期摇出的全部中奖号码的前3位，“排列5”的中奖号码为当期摇出的全部中奖号码，每日进行开</p>
              <p>奖。</p>
              <p class="font-size-1p5 font-weight-bold">第一章 总则</p>
              <p>第一条 根据财政部《彩票发行与销售管理暂行规定》和国家体育总局《体育彩票发行与销售管理暂行办法》特制定本游戏规则。</p>
              <p>第二条 体彩排列3电脑体育彩票由国家体育总局体育彩票管理中心统一发行，在全国范围内采用计算机网络系统进行联合销售。</p>
              <p>第三条 体彩排列3实行自愿购买，凡购买该彩票者即被视为同意并遵守本规则。</p>
              <p class="font-size-1p5 font-weight-bold">第二章 游戏方法</p>
              <p>第四条 购买"体彩排列3"时，由购买者从000-999的数字中选取1个3位数为投注号码进行投注。</p>
              <p>第五条 购买者可在全国各省（区、市）体育彩票管理中心设置的投注站进行投注。投注号码可由投注机随机产生，也可通过投注单将购买者选定的号码输入</p>
              <p>投注机确定。投注号码经系统确认后打印出的兑奖凭证即为体彩排列3电脑体育彩票，交购买者保存。</p>
              <p>第六条 “体彩排列3”电脑体育彩票每注2元人民币。不记名，不挂失，不返还本金，不流通使用</p>
              <p class="font-size-1p5 font-weight-bold">第三章 奖级设定</p>
              <p>第七条 "体彩排列3"按"直选投注"、"组选3"、"组选6"等不同投注方式进行设奖，均设一个奖级，为固定奖</p>
              <p>。</p>
              <p>第八条 各奖级奖金分配： "直选投注"，单注固定奖金1000元。 "组选3"，单注固定奖金320元。 "组选6"，单注固定奖金160元。</p>
              <p>第九条 销售总额的50％为奖金, 分为当期奖金和调节基金。其中，49%为当期奖金，1%为调节基金。</p>
              <p class="font-size-1p5 font-weight-bold">第四章 开奖及公告</p>
              <p>第十条 "体彩排列3"天天开奖，摇奖过程在公证人员监督下进行，通过电视台播出。 "体彩排列3"“排列5”同时开奖，一次产生5个号码，其中奖号码为当</p>
              <p>期摇出的全部中奖号码的前3位。</p>
              <p>第十一条 每期开奖后，国家体育总局体育彩票管理中心需将中奖号码、当期销售总额、各奖等中奖情况以及奖池资金余额等信息，通过新闻媒体向社会公</p>
              <p>布，并将开奖结果通知各销售终端。</p>
              <p class="font-size-1p5 font-weight-bold">第五章 中奖办法</p>
              <p>第十二条 所购彩票与开奖结果对照，符合以下情况即为中奖： "直选投注"：所选号码与中奖号码相同且顺序一致，则该注彩票中奖。例如，中奖号码为</p>
              <p>543，则中奖结果为：543。</p>
              <p>“组选 3”：中奖号码中任意两位数字相同（500.com注：开奖号码中的3个数字有两个相同，即为组三），所选号码与中奖号码相同且顺序不限，则该注</p>
              <p>彩票中奖。例如，中 奖号码为 544 ，则中奖结果为： 544 、 454 、 445 之一均可。</p>
              <p>组选6"： 所选号码与中奖号码相同且顺序不限，则该注彩票中奖。例如，中奖号码为543，则中奖结果为：543、534、453、435、345、354之一均可。</p>
              <p>第十三条 当期每注彩票只有一次中奖机会，不得兼中兼得，另行设立的特别奖项除外。</p>
              <p class="font-size-1p5 font-weight-bold">第六章; 兑奖</p>
              <p>第十四条“体彩排列3”兑奖当期有效。每期自开奖次日起60天为兑奖期，逾期未兑，视为弃奖纳入调节基金。</p>
              <p>第十五条兑奖机构有权查验中奖者的中奖彩票及有效身份证件，兑奖者应予配合。</p>
              <p>第十六条凡伪造、涂改中奖彩票，冒领奖金者，送交司法机关追究法律责任。</p>
              <p class="font-size-1p5 font-weight-bold">第七章; 附则</p>
              <p>第十七条本游戏规则解释权属国家体育总局体育彩票管理中心。</p>
              <p>第十八条本游戏规则自下发之日起执行.</p>
              <p class="text-center font-size-2 font-weight-bold">新玩法补充说明</p>
              <p class="font-size-1p5 font-weight-bold">1、直选组合复式</p>
              <p>排列3玩法直选组合复式票是从0～9中选择M（M>=3)个不重复数字，组合成P(3,M)个单式投注，票面上标明“直选组合复式票”。</p>
              <p>例如：彩民选择1、2、3、4这4个号码，就是要实现包含这4个数字的全部排列3直选号码：123、132、321、312、213、231、124、142、214、241、</p>
              <p>412、421、234、243、324、342、432、423、134、143、341、314、431、413共24注号码，能在一张彩票上表现出来。</p>
              <p class="font-size-1p5 font-weight-bold">2、直选组合胆拖复式</p>
              <p>排列3玩法从0～9中选择M（0&lt;M&lt;=2)个不重复数字作为胆码，选择N（N＋M&gt;=4）个不重复、且不包含在胆码中的数字作为拖码，组合成P(3,3)×C[(3-</p>
              <p>M),N]个直选投注，票面上标明“直选组合胆拖票”。</p>
              <p>例如，胆码为数字1，拖码为2、3、4。该直选组合胆拖票是把123、132、321、312、213、231、124、142、214、241、412、421、134、143、</p>
              <p>341、314、431、413这18注号码在一张彩票上表现出来。</p>
              <p class="font-size-1p5 font-weight-bold">3、直选跨度复式</p>
              <p>什么叫跨度：排列3开奖号码中最大数与最小数之差称为排列3跨度，排列3共有0～9十种跨度。彩民投注时，猜排列3开奖时开奖号码的最大数与最小数之</p>
              <p>差的值，即猜跨度，称为跨度投注。跨度投注分为3种：直选跨度投注、组选3跨度投注、组选6跨度投注。 </p>
              <p>排列3玩法直选跨度票是满足跨度为n（0～9）的所有可能的排列3直选票，票面标明“直选跨度票”。如，直选跨度票，当跨度为0时，包含000、111、</p>
              <p>222、333、444、555、666、777、888、999共10注直选票。</p>
              <p>下表是直选跨度票投注各跨度所包含的直选票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含直选票</td>
                    <td>10注</td>
                    <td>54注</td>
                    <td>95注</td>
                    <td>126注</td>
                    <td>144注</td>
                    <td>150注</td>
                    <td>144注</td>
                    <td>126注</td>
                    <td>96注</td>
                    <td>54注</td>
                  </tr>
                </tbody>
              </table>
              <p class="font-size-1p5 font-weight-bold">4、组选3跨度复式（排列3）</p>
              <p>组选3跨度票是满足跨度为n（0～9）的所有可能的组选3票，票面标明“组选3跨度票”。打印票面显示跨度值，不拆开显示组选3票。</p>
              <p>如，组选3跨度票，当跨度为9时，包含099、900共2注组选3票；</p>
              <p>当跨度为8时，包含088、800、199、911共4注组选3票；</p>
              <p>下表是组选3跨度票投注各跨度所包含的组选3票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含组选6票</td>
                    <td>0注</td>
                    <td>0注</td>
                    <td>8注</td>
                    <td>14注</td>
                    <td>18注</td>
                    <td>20注</td>
                    <td>20注</td>
                    <td>18注</td>
                    <td>14注</td>
                    <td>8注</td>
                  </tr>
                </tbody>
              </table>
              <p>（说明：当跨度为0时，没有符合跨度要求的组选3票投注，注数是0注，所以组选3跨度票不能选择跨度为0。）</p>
              <p class="font-size-1p5 font-weight-bold">5、组选6跨度复式（排列3）</p>
              <p>组选6跨度票是满足跨度为n（0～9）的所有可能的组选6票，票面标明“组选6跨度票”。打印票面显示跨度值，不拆开显示组选6票。</p>
              <p>如，组选6跨度票，当跨度为9时，包含019、029、039、049、059、069、079、089共8注组选6票。</p>
              <p>下表是组选6跨度票投注各跨度所包含的组选6票注数：</p>
              <table class="w-100 text-center">
                <tbody>
                  <tr>
                    <td>跨度</td>
                    <td>0</td>
                    <td>1</td>
                    <td>2</td>
                    <td>3</td>
                    <td>4</td>
                    <td>5</td>
                    <td>6</td>
                    <td>7</td>
                    <td>8</td>
                    <td>9</td>
                  </tr>
                  <tr>
                    <td>含组选3票</td>
                    <td>0注</td>
                    <td>18注</td>
                    <td>16注</td>
                    <td>14注</td>
                    <td>12注</td>
                    <td>10注</td>
                    <td>8注</td>
                    <td>6注</td>
                    <td>4注</td>
                    <td>2注</td>
                  </tr>
                </tbody>
              </table>
              <p>的组选6票投注，注数是0注，所以组选6跨度票不能选择跨度为0、1。）</p>
              <p>6、组选3胆拖（排列3）</p>
              <p>从0～9中选择1个数字作为胆码，选择N（2&lt;=N&lt;=9)个不重复、且不包含在胆码中的数字作为拖码，组合成2*N个组选3投注，票面上标明“组选3胆拖</p>
              <p>票”。</p>
              <p class="font-size-1p5 font-weight-bold">7、组选6胆拖（排列3）</p>
              <p>从0～9中选择M（1&lt;＝M&lt;=2）个不重复数字作为胆码，选择N（N＋M>=4）个不重复、且不包含在胆码中的数字作为拖码，组合成C[(3-M)，N]个组选</p>
              <p>6投注，票面上标明“组选6胆拖票”。</p>
              <p class="font-size-1p5 font-weight-bold">“排列3”设奖方式：</p>
              <p>按“直选投注”、“组选3”、“组选6”分别设奖，资金为：“直选投注”单注固定奖金1000元；“组选3”单注固定奖金320元；“组选6”单注固定奖金</p>
              <p>160元。</p>
            </div>
            <div v-if="code === 'GDKLSF'">广东快乐十分</div>
            <div v-if="code === 'GD11X5'">广东11选5</div>
            <div v-if="code === 'JSK3'">江苏快3</div>
            <div v-if="code === 'SD11X5'">十一运夺金</div>
            <div v-if="code === 'CQXYNC'">重庆辛运农场</div>
            <div v-if="code === 'K3'">快3</div>
            <div v-if="code === '11X5'">11选5</div>
            <div v-if="code === 'BJKL8'">北京快乐8</div>
            <div v-if="code === 'PCDD'">PC蛋蛋</div>
            <div v-if="code === 'FC3D'">福彩3D</div>
            <div v-if="code === 'TWBG'">台湾宾果</div>
          </div>
        </div>
      </Col>
    </Row>
    <Footer />
  </div>
</template>
<style scoped lang="scss">
@import 'Index-scoped.scss';

</style>

<script lang="ts">
import {
  Component,
  Watch,
  Vue,
} from 'vue-property-decorator';

import {
  warn,
} from 'vue-class-component/lib/util';

import {
  Header,
  NavTop,
  NavRight,
  Footer,
} from '@/Commons/';

import {
  LOTTERIES,
  BACKEND,
} from '@/CONFIGS/';


@Component({
  name: 'Rule',
  components: {
    Header,
    NavTop,
    NavRight,
    Footer,
  },
})
class Rule extends Vue {
  public code: string = 'BJPK10';

  public toggleLottery(sCode: string) {
    this.code = sCode;
  }

}

export default Rule;
</script>
